tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
/*
** ###################################################################
**     Processors:          MIMXRT1181CVP2B
**                          MIMXRT1181CVP2C
**                          MIMXRT1181XVP2B
**                          MIMXRT1181XVP2C
**                          MIMXRT1182CVP2B
**                          MIMXRT1182CVP2C
**                          MIMXRT1182XVP2B
**                          MIMXRT1182XVP2C
**                          MIMXRT1186CVJ8C_cm33
**                          MIMXRT1186CVJ8C_cm7
**                          MIMXRT1186XVJ8C_cm33
**                          MIMXRT1186XVJ8C_cm7
**                          MIMXRT1187AVM8B_cm33
**                          MIMXRT1187AVM8B_cm7
**                          MIMXRT1187AVM8C_cm33
**                          MIMXRT1187AVM8C_cm7
**                          MIMXRT1187CVM8B_cm33
**                          MIMXRT1187CVM8B_cm7
**                          MIMXRT1187CVM8C_cm33
**                          MIMXRT1187CVM8C_cm7
**                          MIMXRT1187XVM8B_cm33
**                          MIMXRT1187XVM8B_cm7
**                          MIMXRT1187XVM8C_cm33
**                          MIMXRT1187XVM8C_cm7
**                          MIMXRT1189CVM8B_cm33
**                          MIMXRT1189CVM8B_cm7
**                          MIMXRT1189CVM8C_cm33
**                          MIMXRT1189CVM8C_cm7
**                          MIMXRT1189XVM8B_cm33
**                          MIMXRT1189XVM8B_cm7
**                          MIMXRT1189XVM8C_cm33
**                          MIMXRT1189XVM8C_cm7
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250721
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ECAT
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-03-09)
**         Initial version.
**     - rev. 2.0 (2024-01-18)
**         Header RFP.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_ECAT.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for ECAT
 *
 * CMSIS Peripheral Access Layer for ECAT
 */

#if !defined(PERI_ECAT_H_)
#define PERI_ECAT_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1181CVP2B) || defined(CPU_MIMXRT1181CVP2C) || defined(CPU_MIMXRT1181XVP2B) || defined(CPU_MIMXRT1181XVP2C))
#include "MIMXRT1181_COMMON.h"
#elif (defined(CPU_MIMXRT1182CVP2B) || defined(CPU_MIMXRT1182CVP2C) || defined(CPU_MIMXRT1182XVP2B) || defined(CPU_MIMXRT1182XVP2C))
#include "MIMXRT1182_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm33) || defined(CPU_MIMXRT1186XVJ8C_cm33))
#include "MIMXRT1186_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm7) || defined(CPU_MIMXRT1186XVJ8C_cm7))
#include "MIMXRT1186_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm33) || defined(CPU_MIMXRT1187AVM8C_cm33) || defined(CPU_MIMXRT1187CVM8B_cm33) || defined(CPU_MIMXRT1187CVM8C_cm33) || defined(CPU_MIMXRT1187XVM8B_cm33) || defined(CPU_MIMXRT1187XVM8C_cm33))
#include "MIMXRT1187_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm7) || defined(CPU_MIMXRT1187AVM8C_cm7) || defined(CPU_MIMXRT1187CVM8B_cm7) || defined(CPU_MIMXRT1187CVM8C_cm7) || defined(CPU_MIMXRT1187XVM8B_cm7) || defined(CPU_MIMXRT1187XVM8C_cm7))
#include "MIMXRT1187_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm33) || defined(CPU_MIMXRT1189CVM8C_cm33) || defined(CPU_MIMXRT1189XVM8B_cm33) || defined(CPU_MIMXRT1189XVM8C_cm33))
#include "MIMXRT1189_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm7) || defined(CPU_MIMXRT1189CVM8C_cm7) || defined(CPU_MIMXRT1189XVM8B_cm7) || defined(CPU_MIMXRT1189XVM8C_cm7))
#include "MIMXRT1189_cm7_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ECAT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ECAT_Peripheral_Access_Layer ECAT Peripheral Access Layer
 * @{
 */

/** ECAT - Size of Registers Arrays */
#define ECAT_RX_ERROR_CNTR_COUNT                  2u
#define ECAT_FORWARDED_RX_ERROR_CNTR_COUNT        2u
#define ECAT_LOST_LINK_CNTR_COUNT                 2u
#define ECAT_PHY_PORT_STATUS_COUNT                2u
#define ECAT_FMMU_COUNT                           8u
#define ECAT_SYNCMANAGER_COUNT                    16u

/** ECAT - Register Layout Typedef */
typedef struct {
  __I  uint8_t TYPE;                               /**< Type, offset: 0x0 */
  __I  uint8_t REVISION;                           /**< Revision, offset: 0x1 */
  __I  uint16_t BUILD;                             /**< Build, offset: 0x2 */
  __I  uint8_t FMMUS_SUPPORTED;                    /**< FMMUs supported, offset: 0x4 */
  __I  uint8_t SYNCMANAGERS_SUPPORTED;             /**< SyncManagers supported, offset: 0x5 */
  __I  uint8_t RAM_SIZE;                           /**< RAM Size, offset: 0x6 */
  __I  uint8_t PORT_DESCRIPTOR;                    /**< Port configuration, offset: 0x7 */
  __I  uint16_t ESC_FEATURES_SUPPORTED;            /**< Register ESC Features supported, offset: 0x8 */
       uint8_t RESERVED_0[6];
  union {                                          /* offset: 0x10 */
    __IO uint16_t CONFIGURED_STATION_ADDRESS;        /**< Configured Station Address, offset: 0x10 */
    __I  uint16_t CONFIGURED_STATION_ADDRESS_PDI;    /**< Configured Station Address, offset: 0x10 */
  };
  union {                                          /* offset: 0x12 */
    __I  uint16_t CONFIGURED_STATION_ALIAS;          /**< Configured Station Alias, offset: 0x12 */
    __IO uint16_t CONFIGURED_STATION_ALIAS_PDI;      /**< Configured Station Alias, offset: 0x12 */
  };
       uint8_t RESERVED_1[12];
  union {                                          /* offset: 0x20 */
    __IO uint8_t REGISTER_WRITE_ENABLE;              /**< Register Write Enable, offset: 0x20 */
    __I  uint8_t REGISTER_WRITE_ENABLE_PDI;          /**< Register Write Enable, offset: 0x20 */
  };
  union {                                          /* offset: 0x21 */
    __IO uint8_t REGISTER_WRITE_PROTECTION;          /**< Register Write Protection, offset: 0x21 */
    __I  uint8_t REGISTER_WRITE_PROTECTION_PDI;      /**< Register Write Protection, offset: 0x21 */
  };
       uint8_t RESERVED_2[14];
  union {                                          /* offset: 0x30 */
    __IO uint8_t ESC_WRITE_ENABLE;                   /**< ESC Write Enable, offset: 0x30 */
    __I  uint8_t ESC_WRITE_ENABLE_PDI;               /**< ESC Write Enable, offset: 0x30 */
  };
  union {                                          /* offset: 0x31 */
    __IO uint8_t ESC_WRITE_PROTECTION;               /**< ESC Write Protection, offset: 0x31 */
    __I  uint8_t ESC_WRITE_PROTECTION_PDI;           /**< ESC Write Protection, offset: 0x31 */
  };
       uint8_t RESERVED_3[14];
  union {                                          /* offset: 0x40 */
    __IO uint8_t ESC_RESET_ECAT_WRITE;               /**< ESC Reset ECAT WRITE, offset: 0x40 */
    __I  uint8_t ESC_RESET_ECAT_WRITE_PDI;           /**< ESC Reset ECAT WRITE, offset: 0x40 */
  };
  union {                                          /* offset: 0x41 */
    __I  uint8_t ESC_RESET_PDI_WRITE;                /**< ESC Reset PDI WRITE, offset: 0x41 */
    __IO uint8_t ESC_RESET_PDI_WRITE_PDI;            /**< ESC Reset PDI WRITE, offset: 0x41 */
  };
       uint8_t RESERVED_4[190];
  union {                                          /* offset: 0x100 */
    __IO uint32_t ESC_DL_CONTROL;                    /**< ESC DL Control, offset: 0x100 */
    __I  uint32_t ESC_DL_CONTROL_PDI;                /**< ESC DL Control, offset: 0x100 */
  };
       uint8_t RESERVED_5[4];
  union {                                          /* offset: 0x108 */
    __IO uint16_t PHYSICAL_READ_WRITE_OFFSET;        /**< Physical Read Write Offset, offset: 0x108 */
    __I  uint16_t PHYSICAL_READ_WRITE_OFFSET_PDI;    /**< Physical Read Write Offset, offset: 0x108 */
  };
       uint8_t RESERVED_6[6];
  __I  uint16_t ESC_DL_STATUS;                     /**< ESC DL Status, offset: 0x110 */
       uint8_t RESERVED_7[14];
  union {                                          /* offset: 0x120 */
    __IO uint16_t AL_CONTROL;                        /**< AL Control, offset: 0x120 */
    __I  uint16_t AL_CONTROL_PDI;                    /**< AL Control, offset: 0x120 */
  };
       uint8_t RESERVED_8[14];
  union {                                          /* offset: 0x130 */
    __I  uint16_t AL_STATUS;                         /**< AL Status, offset: 0x130 */
    __IO uint16_t AL_STATUS_PDI;                     /**< AL Status, offset: 0x130 */
  };
       uint8_t RESERVED_9[2];
  union {                                          /* offset: 0x134 */
    __I  uint16_t AL_STATUS_CODE;                    /**< AL Status Code, offset: 0x134 */
    __IO uint16_t AL_STATUS_CODE_PDI;                /**< AL Status Code, offset: 0x134 */
  };
       uint8_t RESERVED_10[2];
  __IO uint8_t RUN_LED_OVERRIDE;                   /**< RUN LED Override, offset: 0x138 */
  __IO uint8_t ERR_LED_OVERRIDE;                   /**< ERR LED Override, offset: 0x139 */
       uint8_t RESERVED_11[6];
  __I  uint8_t PDI_CONTROL;                        /**< PDI Control, offset: 0x140 */
  __I  uint8_t ESC_CONFIGURATION;                  /**< ESC Configuration, offset: 0x141 */
       uint8_t RESERVED_12[12];
  __I  uint16_t PDI_INFORMATION;                   /**< PDI Information, offset: 0x14E */
  __I  uint8_t PDI_ON_CHIP_BUS_CONFIGURATION;      /**< Register PDI On-chip bus configuration, offset: 0x150 */
  __I  uint8_t SYNC_LATCH_1_AND_0_PDI_CONFIGURATION; /**< PDI Configuration Sync Latch 1 and 0 PDI Configuration, offset: 0x151 */
  __I  uint16_t PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION; /**< Register PDI On-chip bus extended configuration., offset: 0x152 */
       uint8_t RESERVED_13[172];
  union {                                          /* offset: 0x200 */
    __IO uint16_t ECAT_EVENT_MASK;                   /**< ECAT Event Mask, offset: 0x200 */
    __I  uint16_t ECAT_EVENT_MASK_PDI;               /**< ECAT Event Mask, offset: 0x200 */
  };
       uint8_t RESERVED_14[2];
  union {                                          /* offset: 0x204 */
    __I  uint32_t PDI_AL_EVENT_MASK;                 /**< PDI AL Event Mask, offset: 0x204 */
    __IO uint32_t PDI_AL_EVENT_MASK_PDI;             /**< PDI AL Event Mask, offset: 0x204 */
  };
       uint8_t RESERVED_15[8];
  __I  uint16_t ECAT_EVENT_REQUEST;                /**< ECAT Event Request, offset: 0x210 */
       uint8_t RESERVED_16[14];
  __I  uint32_t AL_EVENT_REQUEST;                  /**< AL Event request, offset: 0x220 */
       uint8_t RESERVED_17[220];
  union {                                          /* offset: 0x300, array step: 0x2 */
    __IO uint16_t RX_ERROR_COUNTER_PORT[ECAT_RX_ERROR_CNTR_COUNT];   /**< RX Error Counter, array offset: 0x300, array step: 0x2 */
    __I  uint16_t RX_ERROR_COUNTER_PORT_PDI[ECAT_RX_ERROR_CNTR_COUNT];   /**< RX Error Counter, array offset: 0x300, array step: 0x2 */
  };
       uint8_t RESERVED_18[4];
  union {                                          /* offset: 0x308, array step: 0x1 */
    __IO uint8_t FORWARDED_RX_ERROR_COUNTER_PORT[ECAT_FORWARDED_RX_ERROR_CNTR_COUNT];   /**< Forwarded RX Error Counter, array offset: 0x308, array step: 0x1 */
    __I  uint8_t FORWARDED_RX_ERROR_COUNTER_PORT_PDI[ECAT_FORWARDED_RX_ERROR_CNTR_COUNT];   /**< Forwarded RX Error Counter, array offset: 0x308, array step: 0x1 */
  };
       uint8_t RESERVED_19[2];
  union {                                          /* offset: 0x30C */
    __IO uint8_t ECAT_PROCESSING_UNIT_ERROR_COUNTER;   /**< ECAT Processing Unit Error Counter, offset: 0x30C */
    __I  uint8_t ECAT_PROCESSING_UNIT_ERROR_COUNTER_PDI;   /**< ECAT Processing Unit Error Counter, offset: 0x30C */
  };
  union {                                          /* offset: 0x30D */
    __IO uint8_t PDI_ERROR_COUNTER;                  /**< PDI Error counter, offset: 0x30D */
    __I  uint8_t PDI_ERROR_COUNTER_PDI;              /**< PDI Error counter, offset: 0x30D */
  };
  __I  uint8_t ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER; /**< ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_PDI_ERROR_CODE., offset: 0x30E */
       uint8_t RESERVED_20[1];
  union {                                          /* offset: 0x310, array step: 0x1 */
    __IO uint8_t LOST_LINK_COUNTER_PORT[ECAT_LOST_LINK_CNTR_COUNT];   /**< Lost Link Counter, array offset: 0x310, array step: 0x1 */
    __I  uint8_t LOST_LINK_COUNTER_PORT_PDI[ECAT_LOST_LINK_CNTR_COUNT];   /**< Lost Link Counter, array offset: 0x310, array step: 0x1 */
  };
       uint8_t RESERVED_21[238];
  union {                                          /* offset: 0x400 */
    __IO uint16_t WATCHDOG_DIVIDER;                  /**< Watchdog Divider, offset: 0x400 */
    __I  uint16_t WATCHDOG_DIVIDER_PDI;              /**< Watchdog Divider, offset: 0x400 */
  };
       uint8_t RESERVED_22[14];
  union {                                          /* offset: 0x410 */
    __IO uint16_t WATCHDOG_TIME_PDI;                 /**< Register Watchdog Time PDI, offset: 0x410 */
    __I  uint16_t WATCHDOG_TIME_PDI_PDI;             /**< Register Watchdog Time PDI, offset: 0x410 */
  };
       uint8_t RESERVED_23[14];
  union {                                          /* offset: 0x420 */
    __IO uint16_t WATCHDOG_TIME_PROCESS_DATA;        /**< Regsister Watchdog Time Process Data, offset: 0x420 */
    __I  uint16_t WATCHDOG_TIME_PROCESS_DATA_PDI;    /**< Regsister Watchdog Time Process Data, offset: 0x420 */
  };
       uint8_t RESERVED_24[30];
  __I  uint16_t WATCHDOG_STATUS_PROCESS_DATA;      /**< Watchdog Status Process Data, offset: 0x440 */
  union {                                          /* offset: 0x442 */
    __IO uint8_t WATCHDOG_COUNTER_PROCESS_DATA;      /**< Watchdog Counter Process Data, offset: 0x442 */
    __I  uint8_t WATCHDOG_COUNTER_PROCESS_DATA_PDI;   /**< Watchdog Counter Process Data, offset: 0x442 */
  };
  union {                                          /* offset: 0x443 */
    __IO uint8_t WATCHDOG_COUNTER_PDI;               /**< Watchdog Counter PDI, offset: 0x443 */
    __I  uint8_t WATCHDOG_COUNTER_PDI_PDI;           /**< Watchdog Counter PDI, offset: 0x443 */
  };
       uint8_t RESERVED_25[188];
  union {                                          /* offset: 0x500 */
    __IO uint8_t EEPROM_CONFIGURATION;               /**< EEPROM Configuration, offset: 0x500 */
    __I  uint8_t EEPROM_CONFIGURATION_PDI;           /**< EEPROM Configuration, offset: 0x500 */
  };
  union {                                          /* offset: 0x501 */
    __I  uint8_t REGISTER_EEPROM_PDI_ACCESS_STATE;   /**< EEPROM PDI Access State, offset: 0x501 */
    __IO uint8_t REGISTER_EEPROM_PDI_ACCESS_STATE_PDI;   /**< EEPROM PDI Access State, offset: 0x501 */
  };
  union {                                          /* offset: 0x502 */
    __IO uint16_t EEPROM_CONTROL_STATUS;             /**< Register EEPROM Control/Status, offset: 0x502 */
    __IO uint16_t EEPROM_CONTROL_STATUS_PDI;         /**< Register EEPROM Control/Status, offset: 0x502 */
  };
  __IO uint32_t EEPROM_ADDRESS;                    /**< EEPROM Address, offset: 0x504 */
  __IO uint64_t EEPROM_DATA;                       /**< EEPROM Data, offset: 0x508 */
  union {                                          /* offset: 0x510 */
    __IO uint16_t MII_MANAGEMENT_CONTROL_OR_STATUS;   /**< MII Management Control/Status, offset: 0x510 */
    __IO uint16_t MII_MANAGEMENT_CONTROL_OR_STATUS_PDI;   /**< MII Management Control/Status, offset: 0x510 */
  };
  __IO uint8_t PHY_ADDRESS;                        /**< PHY Address, offset: 0x512 */
  __IO uint8_t PHY_REGISTER_ADDRESS;               /**< PHY Register Address, offset: 0x513 */
  __IO uint16_t PHY_DATA;                          /**< PHY Data, offset: 0x514 */
  union {                                          /* offset: 0x516 */
    __IO uint8_t MII_MANAGEMENT_ECAT_ACCESS_STATE;   /**< MII Management ECAT Access State, offset: 0x516 */
    __I  uint8_t MII_MANAGEMENT_ECAT_ACCESS_STATE_PDI;   /**< MII Management ECAT Access State, offset: 0x516 */
  };
  union {                                          /* offset: 0x517 */
    __IO uint8_t MII_MANAGEMENT_PDI_ACCESS_STATE;    /**< MII Management PDI Access State, offset: 0x517 */
    __IO uint8_t MII_MANAGEMENT_PDI_ACCESS_STATE_PDI;   /**< MII Management PDI Access State, offset: 0x517 */
  };
  __IO uint8_t PHY_PORT_STATUS[ECAT_PHY_PORT_STATUS_COUNT]; /**< PHY Port, array offset: 0x518, array step: 0x1 */
       uint8_t RESERVED_26[230];
  struct {                                         /* offset: 0x600, array step: 0x10 */
    union {                                          /* offset: 0x600, array step: 0x10 */
      __IO uint32_t LOGICAL_START_ADDRESS;             /**< Register Logical Start address FMMU, array offset: 0x600, array step: 0x10 */
      __I  uint32_t LOGICAL_START_ADDRESS_PDI;         /**< Register Logical Start address FMMU, array offset: 0x600, array step: 0x10 */
    };
    union {                                          /* offset: 0x604, array step: 0x10 */
      __IO uint16_t LENGTH;                            /**< Register Length FMMU, array offset: 0x604, array step: 0x10 */
      __I  uint16_t LENGTH_PDI;                        /**< Register Length FMMU, array offset: 0x604, array step: 0x10 */
    };
    union {                                          /* offset: 0x606, array step: 0x10 */
      __IO uint8_t LOGICAL_START_BIT;                  /**< Register Start bit FMMU y in logical address space, array offset: 0x606, array step: 0x10 */
      __I  uint8_t LOGICAL_START_BIT_PDI;              /**< Register Start bit FMMU y in logical address space, array offset: 0x606, array step: 0x10 */
    };
    union {                                          /* offset: 0x607, array step: 0x10 */
      __IO uint8_t LOGICAL_STOP_BIT;                   /**< Register Stop bit FMMU y in logical address space, array offset: 0x607, array step: 0x10 */
      __I  uint8_t LOGICAL_STOP_BIT_PDI;               /**< Register Stop bit FMMU y in logical address space, array offset: 0x607, array step: 0x10 */
    };
    union {                                          /* offset: 0x608, array step: 0x10 */
      __IO uint16_t PHYSICAL_START_ADDRESS;            /**< Register Physical Start address FMMU, array offset: 0x608, array step: 0x10 */
      __I  uint16_t PHYSICAL_START_ADDRESS_PDI;        /**< Register Physical Start address FMMU, array offset: 0x608, array step: 0x10 */
    };
    union {                                          /* offset: 0x60A, array step: 0x10 */
      __IO uint8_t PHYSICAL_START_BIT;                 /**< Register Physical Start bit FMMU, array offset: 0x60A, array step: 0x10 */
      __I  uint8_t PHYSICAL_START_BIT_PDI;             /**< Register Physical Start bit FMMU, array offset: 0x60A, array step: 0x10 */
    };
    union {                                          /* offset: 0x60B, array step: 0x10 */
      __IO uint8_t TYPE;                               /**< Register Type FMMU y, array offset: 0x60B, array step: 0x10 */
      __I  uint8_t TYPE_PDI;                           /**< Register Type FMMU y, array offset: 0x60B, array step: 0x10 */
    };
    union {                                          /* offset: 0x60C, array step: 0x10 */
      __IO uint8_t ACTIVATE;                           /**< Register Activate FMMU, array offset: 0x60C, array step: 0x10 */
      __I  uint8_t ACTIVATE_PDI;                       /**< Register Activate FMMU, array offset: 0x60C, array step: 0x10 */
    };
         uint8_t RESERVED_0[3];
  } FMMU[ECAT_FMMU_COUNT];
       uint8_t RESERVED_27[384];
  struct {                                         /* offset: 0x800, array step: 0x8 */
    union {                                          /* offset: 0x800, array step: 0x8 */
      __IO uint16_t PHYSICAL_START_ADDRESS;            /**< Register physical Start Address SyncManager, array offset: 0x800, array step: 0x8 */
      __I  uint16_t PHYSICAL_START_ADDRESS_PDI;        /**< Register physical Start Address SyncManager, array offset: 0x800, array step: 0x8 */
    };
    union {                                          /* offset: 0x802, array step: 0x8 */
      __IO uint16_t LENGTH;                            /**< Register Length SyncManager, array offset: 0x802, array step: 0x8 */
      __I  uint16_t LENGTH_PDI;                        /**< Register Length SyncManager, array offset: 0x802, array step: 0x8 */
    };
    union {                                          /* offset: 0x804, array step: 0x8 */
      __IO uint8_t CONTROL_REGISTER;                   /**< Register Control Register SyncManager, array offset: 0x804, array step: 0x8 */
      __I  uint8_t CONTROL_REGISTER_PDI;               /**< Register Control Register SyncManager, array offset: 0x804, array step: 0x8 */
    };
    __I  uint8_t STATUS;                             /**< Register Status Register SyncManager, array offset: 0x805, array step: 0x8 */
    union {                                          /* offset: 0x806, array step: 0x8 */
      __IO uint8_t ACTIVATE;                           /**< Register Activate SyncManager, array offset: 0x806, array step: 0x8 */
      __I  uint8_t ACTIVATE_PDI;                       /**< Register Activate SyncManager, array offset: 0x806, array step: 0x8 */
    };
    union {                                          /* offset: 0x807, array step: 0x8 */
      __I  uint8_t PDI_CONTROL;                        /**< Register PDI Control SyncManager, array offset: 0x807, array step: 0x8 */
      __IO uint8_t PDI_CONTROL_PDI;                    /**< Register PDI Control SyncManager, array offset: 0x807, array step: 0x8 */
    };
  } SYNCMANAGER[ECAT_SYNCMANAGER_COUNT];
       uint8_t RESERVED_28[128];
  union {                                          /* offset: 0x900 */
    __IO uint32_t RECEIVE_TIMES;                     /**< Distributed Clocks Receive Times, offset: 0x900 */
    __I  uint32_t RECEIVE_TIMES_PDI;                 /**< Distributed Clocks Receive Times, offset: 0x900 */
  };
  __I  uint32_t RECEIVE_TIME_PORT_1;               /**< Distributed Clocks Receive Time Port 1, offset: 0x904 */
       uint8_t RESERVED_29[8];
  union {                                          /* offset: 0x910 */
