tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
    __IO uint64_t SYSTEM_TIME;                       /**< Register System Time, offset: 0x910 */
    __IO uint64_t SYSTEM_TIME_PDI;                   /**< Register System Time, offset: 0x910 */
  };
  __I  uint64_t RECEIVE_TIME_ECAT_PROCESSING_UNIT; /**< Distributed Clocks Register Receive Time ECAT Processing Unit, offset: 0x918 */
  __IO uint64_t SYSTEM_TIME_OFFSET;                /**< Register System Time Offset, offset: 0x920 */
  __IO uint32_t SYSTEM_TIME_DELAY;                 /**< Register System Time Delay, offset: 0x928 */
  __I  uint32_t SYSTEM_TIME_DIFFERENCE;            /**< Register System Time Difference, offset: 0x92C */
  __IO uint16_t SPEED_COUNTER_START;               /**< Register Speed Counter Start, offset: 0x930 */
  __I  uint16_t SPEED_COUNTER_DIFF;                /**< Register Speed Counter Diff, offset: 0x932 */
  __IO uint8_t SYSTEM_TIME_DIFFERENCE_FILTER_DEPTH; /**< Register System Time Difference Filter Depth, offset: 0x934 */
  __IO uint8_t SPEED_COUNTER_FILTER_DEPTH;         /**< Register Speed Counter Filter Depth, offset: 0x935 */
       uint8_t RESERVED_30[74];
  union {                                          /* offset: 0x980 */
    __IO uint8_t CYCLIC_UNIT_CONTROL;                /**< Register Cyclic Unit Control, offset: 0x980 */
    __I  uint8_t CYCLIC_UNIT_CONTROL_PDI;            /**< Register Cyclic Unit Control, offset: 0x980 */
  };
  __IO uint8_t UNIT_ACTIVATION_REGISTER;           /**< Register Activation register, offset: 0x981 */
  __I  uint16_t UNI_PULSE_LENGTH_OF_SYNCSIGNALS;   /**< Register Pulse Length of SyncSignals, offset: 0x982 */
  __I  uint8_t UNIT_ACTIVATION_STATUS;             /**< Register Activation Status, offset: 0x984 */
       uint8_t RESERVED_31[9];
  __I  uint8_t UNIT_SYNC0_STATUS;                  /**< Register SYNC0 Status, offset: 0x98E */
  __I  uint8_t UNIT_SYNC1_STATUS;                  /**< Register SYNC1 Status, offset: 0x98F */
  __IO uint64_t UNIT_START_TIME_CYCLIC_OPERATION;  /**< Register Start Time Cyclic Operation, offset: 0x990 */
  __I  uint64_t UNIT_NEXT_SYNC1_PULSE;             /**< Register Next SYNC1 Pulse, offset: 0x998 */
  __IO uint32_t UNIT_SYNC0_CYCLE_TIME;             /**< Register SYNC0 Cycle Time, offset: 0x9A0 */
  __IO uint32_t UNIT_SYNC1_CYCLE_TIME;             /**< Register SYNC1 Cycle Time, offset: 0x9A4 */
  __IO uint8_t LATCH0_CONTROL;                     /**< Register Latch0 Control, offset: 0x9A8 */
  __IO uint8_t LATCH1_CONTROL;                     /**< Register Latch1 Control, offset: 0x9A9 */
       uint8_t RESERVED_32[4];
  __I  uint8_t LATCH0_STATUS;                      /**< Register Latch0 Status, offset: 0x9AE */
  __I  uint8_t LATCH1_STATUS;                      /**< Register Latch1 Status, offset: 0x9AF */
  __I  uint64_t LATCH0_TIME_POSITIVE_EDGE;         /**< Register Latch0 Time Positive Edge, offset: 0x9B0 */
  __I  uint64_t LATCH0_TIME_NEGATIVE_EDGE;         /**< Register Latch0 Time Negative Edge, offset: 0x9B8 */
  __I  uint64_t LATCH1_TIME_POSITIVE_EDGE;         /**< Register Latch1 Time Positive Edge, offset: 0x9C0 */
  __I  uint64_t LATCH1_TIME_NEGATIVE_EDGE;         /**< Register Latch1 Time Negative Edge, offset: 0x9C8 */
       uint8_t RESERVED_33[32];
  __I  uint32_t ETHERCAT_BUFFER_CHANGE_EVENT_TIME; /**< Register EtherCAT Buffer Change Event Time, offset: 0x9F0 */
       uint8_t RESERVED_34[4];
  __I  uint32_t PDI_BUFFER_START_EVENT_TIME;       /**< Register PDI Buffer Start Event Time, offset: 0x9F8 */
  __I  uint32_t PDI_BUFFER_CHANGE_EVENT_TIME;      /**< Register PDI Buffer Change Event Time, offset: 0x9FC */
       uint8_t RESERVED_35[1024];
  __I  uint64_t PRODUCT_ID_IP_CORE;                /**< Register Product ID IP Core, offset: 0xE00 */
  __I  uint64_t VENDOR_ID_IP_CORE;                 /**< Register Vendor ID IP Core, offset: 0xE08 */
       uint8_t RESERVED_36[256];
  __IO uint16_t GENERAL_PURPOSE_OUTPUTS;           /**< Register General Purpose Outputs, offset: 0xF10 */
       uint8_t RESERVED_37[6];
  __I  uint16_t GENERAL_PURPOSE_INPUTS;            /**< Register General Purpose Inputs, offset: 0xF18 */
} ECAT_Type;

/* ----------------------------------------------------------------------------
   -- ECAT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ECAT_Register_Masks ECAT Register Masks
 * @{
 */

/*! @name TYPE - Type */
/*! @{ */

#define ECAT_TYPE_BF0_MASK                       (0xFFU)
#define ECAT_TYPE_BF0_SHIFT                      (0U)
/*! BF0 - Type of EtherCAT controller */
#define ECAT_TYPE_BF0(x)                         (((uint8_t)(((uint8_t)(x)) << ECAT_TYPE_BF0_SHIFT)) & ECAT_TYPE_BF0_MASK)
/*! @} */

/*! @name REVISION - Revision */
/*! @{ */

#define ECAT_REVISION_BF0_MASK                   (0xFFU)
#define ECAT_REVISION_BF0_SHIFT                  (0U)
/*! BF0 - Revision of EtherCAT controller. */
#define ECAT_REVISION_BF0(x)                     (((uint8_t)(((uint8_t)(x)) << ECAT_REVISION_BF0_SHIFT)) & ECAT_REVISION_BF0_MASK)
/*! @} */

/*! @name BUILD - Build */
/*! @{ */

#define ECAT_BUILD_BF0_MASK                      (0xFFFFU)
#define ECAT_BUILD_BF0_SHIFT                     (0U)
/*! BF0 - Build of EtherCAT controller */
#define ECAT_BUILD_BF0(x)                        (((uint16_t)(((uint16_t)(x)) << ECAT_BUILD_BF0_SHIFT)) & ECAT_BUILD_BF0_MASK)
/*! @} */

/*! @name FMMUS_SUPPORTED - FMMUs supported */
/*! @{ */

#define ECAT_FMMUS_SUPPORTED_BF0_MASK            (0xFFU)
#define ECAT_FMMUS_SUPPORTED_BF0_SHIFT           (0U)
/*! BF0 - Number of supported FMMU channels (or entities) */
#define ECAT_FMMUS_SUPPORTED_BF0(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_FMMUS_SUPPORTED_BF0_SHIFT)) & ECAT_FMMUS_SUPPORTED_BF0_MASK)
/*! @} */

/*! @name SYNCMANAGERS_SUPPORTED - SyncManagers supported */
/*! @{ */

#define ECAT_SYNCMANAGERS_SUPPORTED_BF0_MASK     (0xFFU)
#define ECAT_SYNCMANAGERS_SUPPORTED_BF0_SHIFT    (0U)
/*! BF0 - Number of supported SyncManager channels (or entities) */
#define ECAT_SYNCMANAGERS_SUPPORTED_BF0(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_SYNCMANAGERS_SUPPORTED_BF0_SHIFT)) & ECAT_SYNCMANAGERS_SUPPORTED_BF0_MASK)
/*! @} */

/*! @name RAM_SIZE - RAM Size */
/*! @{ */

#define ECAT_RAM_SIZE_BF0_MASK                   (0xFFU)
#define ECAT_RAM_SIZE_BF0_SHIFT                  (0U)
/*! BF0 - Process Data RAM size supported in KByte */
#define ECAT_RAM_SIZE_BF0(x)                     (((uint8_t)(((uint8_t)(x)) << ECAT_RAM_SIZE_BF0_SHIFT)) & ECAT_RAM_SIZE_BF0_MASK)
/*! @} */

/*! @name PORT_DESCRIPTOR - Port configuration */
/*! @{ */

#define ECAT_PORT_DESCRIPTOR_BF0_MASK            (0x3U)
#define ECAT_PORT_DESCRIPTOR_BF0_SHIFT           (0U)
/*! BF0 - Port 0 */
#define ECAT_PORT_DESCRIPTOR_BF0(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PORT_DESCRIPTOR_BF0_SHIFT)) & ECAT_PORT_DESCRIPTOR_BF0_MASK)

