tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_PORT_DESCRIPTOR_BF2_MASK            (0xCU)
#define ECAT_PORT_DESCRIPTOR_BF2_SHIFT           (2U)
/*! BF2 - Port 1 */
#define ECAT_PORT_DESCRIPTOR_BF2(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PORT_DESCRIPTOR_BF2_SHIFT)) & ECAT_PORT_DESCRIPTOR_BF2_MASK)

#define ECAT_PORT_DESCRIPTOR_BF4_MASK            (0x30U)
#define ECAT_PORT_DESCRIPTOR_BF4_SHIFT           (4U)
/*! BF4 - Reserved */
#define ECAT_PORT_DESCRIPTOR_BF4(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PORT_DESCRIPTOR_BF4_SHIFT)) & ECAT_PORT_DESCRIPTOR_BF4_MASK)

#define ECAT_PORT_DESCRIPTOR_BF6_MASK            (0xC0U)
#define ECAT_PORT_DESCRIPTOR_BF6_SHIFT           (6U)
/*! BF6 - Reserved */
#define ECAT_PORT_DESCRIPTOR_BF6(x)              (((uint8_t)(((uint8_t)(x)) << ECAT_PORT_DESCRIPTOR_BF6_SHIFT)) & ECAT_PORT_DESCRIPTOR_BF6_MASK)
/*! @} */

/*! @name ESC_FEATURES_SUPPORTED - Register ESC Features supported */
/*! @{ */

#define ECAT_ESC_FEATURES_SUPPORTED_BF0_MASK     (0x1U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF0_SHIFT    (0U)
/*! BF0 - FMMU Operation:
 *  0b0..Bit oriented
 *  0b1..Byte oriented
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF0(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF0_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF0_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF1_MASK     (0x2U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF1_SHIFT    (1U)
/*! BF1 - Unused register access:
 *  0b0..allowed
 *  0b1..not supported
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF1(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF1_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF1_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF2_MASK     (0x4U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF2_SHIFT    (2U)
/*! BF2 - Distributed Clocks:
 *  0b0..Not available
 *  0b1..Available
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF2(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF2_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF2_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF3_MASK     (0x8U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF3_SHIFT    (3U)
/*! BF3 - Distributed Clocks (width):
 *  0b0..32 bit
 *  0b1..64 bit
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF3(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF3_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF3_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF6_MASK     (0x40U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF6_SHIFT    (6U)
/*! BF6 - Enhanced Link Detection MII:
 *  0b0..Not available
 *  0b1..Available
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF6(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF6_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF6_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF7_MASK     (0x80U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF7_SHIFT    (7U)
/*! BF7 - Separate Handling of FCS Errors:
 *  0b0..Not supported
 *  0b1..Supported, frames with wrong FCS and additional nibble will be counted separately in Forwarded RX Error Counter
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF7(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF7_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF7_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF8_MASK     (0x100U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF8_SHIFT    (8U)
/*! BF8 - Enhanced DC SYNC Activation
 *  0b0..Not available
 *  0b1..Available
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF8(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF8_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF8_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF9_MASK     (0x200U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF9_SHIFT    (9U)
/*! BF9 - EtherCAT LRW command support:
 *  0b0..Supported
 *  0b1..Not supported
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF9(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF9_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF9_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF10_MASK    (0x400U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF10_SHIFT   (10U)
/*! BF10 - EtherCAT read/write command support (BRW, APRW, FPRW):
 *  0b0..Supported
 *  0b1..Not supported
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF10(x)      (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF10_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF10_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF11_MASK    (0x800U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF11_SHIFT   (11U)
/*! BF11 - Fixed FMMU/SyncManager configuration
 *  0b0..Variable configuration
 *  0b1..Fixed configuration (refer to documentation of supporting ESCs)
 */
#define ECAT_ESC_FEATURES_SUPPORTED_BF11(x)      (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF11_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF11_MASK)

#define ECAT_ESC_FEATURES_SUPPORTED_BF12_MASK    (0xF000U)
#define ECAT_ESC_FEATURES_SUPPORTED_BF12_SHIFT   (12U)
/*! BF12 - Reserved */
#define ECAT_ESC_FEATURES_SUPPORTED_BF12(x)      (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_FEATURES_SUPPORTED_BF12_SHIFT)) & ECAT_ESC_FEATURES_SUPPORTED_BF12_MASK)
/*! @} */

/*! @name CONFIGURED_STATION_ADDRESS - Configured Station Address */
/*! @{ */

#define ECAT_CONFIGURED_STATION_ADDRESS_BF0_MASK (0xFFFFU)
#define ECAT_CONFIGURED_STATION_ADDRESS_BF0_SHIFT (0U)
/*! BF0 - Address used for node addressing (FPRD/FPWR/FPRW/FRMW commands). */
#define ECAT_CONFIGURED_STATION_ADDRESS_BF0(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_CONFIGURED_STATION_ADDRESS_BF0_SHIFT)) & ECAT_CONFIGURED_STATION_ADDRESS_BF0_MASK)
/*! @} */

/*! @name CONFIGURED_STATION_ADDRESS_PDI - Configured Station Address */
/*! @{ */

#define ECAT_CONFIGURED_STATION_ADDRESS_PDI_BF0_MASK (0xFFFFU)
#define ECAT_CONFIGURED_STATION_ADDRESS_PDI_BF0_SHIFT (0U)
/*! BF0 - Address used for node addressing (FPRD/FPWR/FPRW/FRMW commands). */
#define ECAT_CONFIGURED_STATION_ADDRESS_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_CONFIGURED_STATION_ADDRESS_PDI_BF0_SHIFT)) & ECAT_CONFIGURED_STATION_ADDRESS_PDI_BF0_MASK)
/*! @} */

/*! @name CONFIGURED_STATION_ALIAS - Configured Station Alias */
/*! @{ */

