tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_ESC_DL_CONTROL_PDI_BF8_MASK         (0x300U)
#define ECAT_ESC_DL_CONTROL_PDI_BF8_SHIFT        (8U)
/*! BF8 - Loop Port 0:
 *  0b00..Auto
 *  0b01..Auto Close
 *  0b10..Open
 *  0b11..Closed
 */
#define ECAT_ESC_DL_CONTROL_PDI_BF8(x)           (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF8_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF8_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF10_MASK        (0xC00U)
#define ECAT_ESC_DL_CONTROL_PDI_BF10_SHIFT       (10U)
/*! BF10 - Loop Port 1:
 *  0b00..Auto
 *  0b01..Auto Close
 *  0b10..Open
 *  0b11..Closed
 */
#define ECAT_ESC_DL_CONTROL_PDI_BF10(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF10_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF10_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF12_MASK        (0x3000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF12_SHIFT       (12U)
/*! BF12 - Reserved */
#define ECAT_ESC_DL_CONTROL_PDI_BF12(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF12_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF12_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF14_MASK        (0xC000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF14_SHIFT       (14U)
/*! BF14 - Reserved */
#define ECAT_ESC_DL_CONTROL_PDI_BF14(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF14_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF14_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF16_MASK        (0x70000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF16_SHIFT       (16U)
/*! BF16 - RX FIFO Size (ESC delays start of forwarding until FIFO is at least half full). */
#define ECAT_ESC_DL_CONTROL_PDI_BF16(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF16_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF16_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF20_MASK        (0x300000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF20_SHIFT       (20U)
/*! BF20 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_PDI_BF20(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF20_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF20_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF23_MASK        (0x800000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF23_SHIFT       (23U)
/*! BF23 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_PDI_BF23(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF23_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF23_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF24_MASK        (0x1000000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF24_SHIFT       (24U)
/*! BF24 - Station alias:
 *  0b0..Ignore Station Alias
 *  0b1..Alias can be used for all configured address command types (FPRD, FPWR, ...)
 */
#define ECAT_ESC_DL_CONTROL_PDI_BF24(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF24_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF24_MASK)

#define ECAT_ESC_DL_CONTROL_PDI_BF25_MASK        (0xFE000000U)
#define ECAT_ESC_DL_CONTROL_PDI_BF25_SHIFT       (25U)
/*! BF25 - Reserved, write 0 */
#define ECAT_ESC_DL_CONTROL_PDI_BF25(x)          (((uint32_t)(((uint32_t)(x)) << ECAT_ESC_DL_CONTROL_PDI_BF25_SHIFT)) & ECAT_ESC_DL_CONTROL_PDI_BF25_MASK)
/*! @} */

/*! @name PHYSICAL_READ_WRITE_OFFSET - Physical Read Write Offset */
/*! @{ */

#define ECAT_PHYSICAL_READ_WRITE_OFFSET_BF0_MASK (0xFFFFU)
#define ECAT_PHYSICAL_READ_WRITE_OFFSET_BF0_SHIFT (0U)
/*! BF0 - This register is used for ReadWrite commands in Device Addressing mode (FPRW, APRW, BRW). */
#define ECAT_PHYSICAL_READ_WRITE_OFFSET_BF0(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_PHYSICAL_READ_WRITE_OFFSET_BF0_SHIFT)) & ECAT_PHYSICAL_READ_WRITE_OFFSET_BF0_MASK)
/*! @} */

/*! @name PHYSICAL_READ_WRITE_OFFSET_PDI - Physical Read Write Offset */
/*! @{ */

#define ECAT_PHYSICAL_READ_WRITE_OFFSET_PDI_BF0_MASK (0xFFFFU)
#define ECAT_PHYSICAL_READ_WRITE_OFFSET_PDI_BF0_SHIFT (0U)
/*! BF0 - This register is used for ReadWrite commands in Device Addressing mode (FPRW, APRW, BRW). */
#define ECAT_PHYSICAL_READ_WRITE_OFFSET_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_PHYSICAL_READ_WRITE_OFFSET_PDI_BF0_SHIFT)) & ECAT_PHYSICAL_READ_WRITE_OFFSET_PDI_BF0_MASK)
/*! @} */

/*! @name ESC_DL_STATUS - ESC DL Status */
/*! @{ */

#define ECAT_ESC_DL_STATUS_BF0_MASK              (0x1U)
#define ECAT_ESC_DL_STATUS_BF0_SHIFT             (0U)
/*! BF0 - Register ESC DL Status
 *  0b0..PDI operational/EEPROM loaded correctly:
 *  0b1..EEPROM loaded correctly, PDI operational (access to Process Data RAM)
 */
#define ECAT_ESC_DL_STATUS_BF0(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF0_SHIFT)) & ECAT_ESC_DL_STATUS_BF0_MASK)

#define ECAT_ESC_DL_STATUS_BF1_MASK              (0x2U)
#define ECAT_ESC_DL_STATUS_BF1_SHIFT             (1U)
/*! BF1 - PDI Watchdog Status:
 *  0b0..Watchdog expired
 *  0b1..Watchdog reloaded
 */
#define ECAT_ESC_DL_STATUS_BF1(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF1_SHIFT)) & ECAT_ESC_DL_STATUS_BF1_MASK)

#define ECAT_ESC_DL_STATUS_BF2_MASK              (0x4U)
#define ECAT_ESC_DL_STATUS_BF2_SHIFT             (2U)
/*! BF2 - Enhanced Link detection:
 *  0b0..Deactivated for all ports
 *  0b1..Activated for at least one port
 */
#define ECAT_ESC_DL_STATUS_BF2(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF2_SHIFT)) & ECAT_ESC_DL_STATUS_BF2_MASK)

#define ECAT_ESC_DL_STATUS_BF3_MASK              (0x8U)
#define ECAT_ESC_DL_STATUS_BF3_SHIFT             (3U)
/*! BF3 - Reserved */
#define ECAT_ESC_DL_STATUS_BF3(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF3_SHIFT)) & ECAT_ESC_DL_STATUS_BF3_MASK)

#define ECAT_ESC_DL_STATUS_BF4_MASK              (0x10U)
#define ECAT_ESC_DL_STATUS_BF4_SHIFT             (4U)
/*! BF4 - Physical link on Port 0:
 *  0b0..No link
 *  0b1..Link detected
 */
#define ECAT_ESC_DL_STATUS_BF4(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF4_SHIFT)) & ECAT_ESC_DL_STATUS_BF4_MASK)

#define ECAT_ESC_DL_STATUS_BF5_MASK              (0x20U)
#define ECAT_ESC_DL_STATUS_BF5_SHIFT             (5U)
/*! BF5 - Physical link on Port 1:
 *  0b0..No link
 *  0b1..Link detected
 */
#define ECAT_ESC_DL_STATUS_BF5(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF5_SHIFT)) & ECAT_ESC_DL_STATUS_BF5_MASK)

#define ECAT_ESC_DL_STATUS_BF6_MASK              (0x40U)
#define ECAT_ESC_DL_STATUS_BF6_SHIFT             (6U)
/*! BF6 - Reserved */
#define ECAT_ESC_DL_STATUS_BF6(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF6_SHIFT)) & ECAT_ESC_DL_STATUS_BF6_MASK)

#define ECAT_ESC_DL_STATUS_BF7_MASK              (0x80U)
#define ECAT_ESC_DL_STATUS_BF7_SHIFT             (7U)
/*! BF7 - Reserved */
#define ECAT_ESC_DL_STATUS_BF7(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF7_SHIFT)) & ECAT_ESC_DL_STATUS_BF7_MASK)

#define ECAT_ESC_DL_STATUS_BF8_MASK              (0x100U)
#define ECAT_ESC_DL_STATUS_BF8_SHIFT             (8U)
/*! BF8 - Loop Port 0:
 *  0b0..Open
 *  0b1..Closed
 */
#define ECAT_ESC_DL_STATUS_BF8(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF8_SHIFT)) & ECAT_ESC_DL_STATUS_BF8_MASK)

#define ECAT_ESC_DL_STATUS_BF9_MASK              (0x200U)
#define ECAT_ESC_DL_STATUS_BF9_SHIFT             (9U)
/*! BF9 - Communication on Port 0:
 *  0b0..No stable communication
 *  0b1..Communication established
 */
#define ECAT_ESC_DL_STATUS_BF9(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF9_SHIFT)) & ECAT_ESC_DL_STATUS_BF9_MASK)

#define ECAT_ESC_DL_STATUS_BF10_MASK             (0x400U)
#define ECAT_ESC_DL_STATUS_BF10_SHIFT            (10U)
/*! BF10 - Loop Port 1
 *  0b0..Open
 *  0b1..Closed
 */
#define ECAT_ESC_DL_STATUS_BF10(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF10_SHIFT)) & ECAT_ESC_DL_STATUS_BF10_MASK)

#define ECAT_ESC_DL_STATUS_BF11_MASK             (0x800U)
#define ECAT_ESC_DL_STATUS_BF11_SHIFT            (11U)
/*! BF11 - Communication on Port 1:
 *  0b0..No stable communication
 *  0b1..Communication established
 */
#define ECAT_ESC_DL_STATUS_BF11(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF11_SHIFT)) & ECAT_ESC_DL_STATUS_BF11_MASK)

