tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_ESC_DL_STATUS_BF12_MASK             (0x1000U)
#define ECAT_ESC_DL_STATUS_BF12_SHIFT            (12U)
/*! BF12 - Reserved */
#define ECAT_ESC_DL_STATUS_BF12(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF12_SHIFT)) & ECAT_ESC_DL_STATUS_BF12_MASK)

#define ECAT_ESC_DL_STATUS_BF13_MASK             (0x2000U)
#define ECAT_ESC_DL_STATUS_BF13_SHIFT            (13U)
/*! BF13 - Reserved */
#define ECAT_ESC_DL_STATUS_BF13(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF13_SHIFT)) & ECAT_ESC_DL_STATUS_BF13_MASK)

#define ECAT_ESC_DL_STATUS_BF14_MASK             (0x4000U)
#define ECAT_ESC_DL_STATUS_BF14_SHIFT            (14U)
/*! BF14 - Reserved */
#define ECAT_ESC_DL_STATUS_BF14(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF14_SHIFT)) & ECAT_ESC_DL_STATUS_BF14_MASK)

#define ECAT_ESC_DL_STATUS_BF15_MASK             (0x8000U)
#define ECAT_ESC_DL_STATUS_BF15_SHIFT            (15U)
/*! BF15 - Reserved */
#define ECAT_ESC_DL_STATUS_BF15(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_ESC_DL_STATUS_BF15_SHIFT)) & ECAT_ESC_DL_STATUS_BF15_MASK)
/*! @} */

/*! @name AL_CONTROL - AL Control */
/*! @{ */

#define ECAT_AL_CONTROL_BF0_MASK                 (0xFU)
#define ECAT_AL_CONTROL_BF0_SHIFT                (0U)
/*! BF0 - Initiate State Transition of the Device State Machine: */
#define ECAT_AL_CONTROL_BF0(x)                   (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_BF0_SHIFT)) & ECAT_AL_CONTROL_BF0_MASK)

#define ECAT_AL_CONTROL_BF4_MASK                 (0x10U)
#define ECAT_AL_CONTROL_BF4_SHIFT                (4U)
/*! BF4 - Error Ind Ack
 *  0b0..No Ack of Error Ind in AL status register
 *  0b1..Ack of Error Ind in AL status register
 */
#define ECAT_AL_CONTROL_BF4(x)                   (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_BF4_SHIFT)) & ECAT_AL_CONTROL_BF4_MASK)

#define ECAT_AL_CONTROL_BF5_MASK                 (0x20U)
#define ECAT_AL_CONTROL_BF5_SHIFT                (5U)
/*! BF5 - Device Identification:
 *  0b0..No request
 *  0b1..Device Identification request
 */
#define ECAT_AL_CONTROL_BF5(x)                   (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_BF5_SHIFT)) & ECAT_AL_CONTROL_BF5_MASK)

#define ECAT_AL_CONTROL_BF6_MASK                 (0xFFC0U)
#define ECAT_AL_CONTROL_BF6_SHIFT                (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_AL_CONTROL_BF6(x)                   (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_BF6_SHIFT)) & ECAT_AL_CONTROL_BF6_MASK)
/*! @} */

/*! @name AL_CONTROL_PDI - AL Control */
/*! @{ */

#define ECAT_AL_CONTROL_PDI_BF0_MASK             (0xFU)
#define ECAT_AL_CONTROL_PDI_BF0_SHIFT            (0U)
/*! BF0 - Initiate State Transition of the Device State Machine: */
#define ECAT_AL_CONTROL_PDI_BF0(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_PDI_BF0_SHIFT)) & ECAT_AL_CONTROL_PDI_BF0_MASK)

#define ECAT_AL_CONTROL_PDI_BF4_MASK             (0x10U)
#define ECAT_AL_CONTROL_PDI_BF4_SHIFT            (4U)
/*! BF4 - Error Ind Ack
 *  0b0..No Ack of Error Ind in AL status register
 *  0b1..Ack of Error Ind in AL status register
 */
#define ECAT_AL_CONTROL_PDI_BF4(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_PDI_BF4_SHIFT)) & ECAT_AL_CONTROL_PDI_BF4_MASK)

#define ECAT_AL_CONTROL_PDI_BF5_MASK             (0x20U)
#define ECAT_AL_CONTROL_PDI_BF5_SHIFT            (5U)
/*! BF5 - Device Identification:
 *  0b0..No request
 *  0b1..Device Identification request
 */
#define ECAT_AL_CONTROL_PDI_BF5(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_PDI_BF5_SHIFT)) & ECAT_AL_CONTROL_PDI_BF5_MASK)

#define ECAT_AL_CONTROL_PDI_BF6_MASK             (0xFFC0U)
#define ECAT_AL_CONTROL_PDI_BF6_SHIFT            (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_AL_CONTROL_PDI_BF6(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_AL_CONTROL_PDI_BF6_SHIFT)) & ECAT_AL_CONTROL_PDI_BF6_MASK)
/*! @} */

/*! @name AL_STATUS - AL Status */
/*! @{ */

#define ECAT_AL_STATUS_BF0_MASK                  (0xFU)
#define ECAT_AL_STATUS_BF0_SHIFT                 (0U)
/*! BF0 - Actual State of the Device State Machine: */
#define ECAT_AL_STATUS_BF0(x)                    (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_BF0_SHIFT)) & ECAT_AL_STATUS_BF0_MASK)

#define ECAT_AL_STATUS_BF4_MASK                  (0x10U)
#define ECAT_AL_STATUS_BF4_SHIFT                 (4U)
/*! BF4 - Error Ind:
 *  0b0..Device is in State as requested or Flag cleared by command
 *  0b1..Device has not entered requested State or changed State as result of a local action
 */
#define ECAT_AL_STATUS_BF4(x)                    (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_BF4_SHIFT)) & ECAT_AL_STATUS_BF4_MASK)

#define ECAT_AL_STATUS_BF5_MASK                  (0x20U)
#define ECAT_AL_STATUS_BF5_SHIFT                 (5U)
/*! BF5 - Device Identification:
 *  0b0..Device Identification not valid
 *  0b1..Device Identification loaded
 */
#define ECAT_AL_STATUS_BF5(x)                    (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_BF5_SHIFT)) & ECAT_AL_STATUS_BF5_MASK)

#define ECAT_AL_STATUS_BF6_MASK                  (0xFFC0U)
#define ECAT_AL_STATUS_BF6_SHIFT                 (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_AL_STATUS_BF6(x)                    (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_BF6_SHIFT)) & ECAT_AL_STATUS_BF6_MASK)
/*! @} */

/*! @name AL_STATUS_PDI - AL Status */
/*! @{ */

#define ECAT_AL_STATUS_PDI_BF0_MASK              (0xFU)
#define ECAT_AL_STATUS_PDI_BF0_SHIFT             (0U)
/*! BF0 - Actual State of the Device State Machine: */
#define ECAT_AL_STATUS_PDI_BF0(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_PDI_BF0_SHIFT)) & ECAT_AL_STATUS_PDI_BF0_MASK)

#define ECAT_AL_STATUS_PDI_BF4_MASK              (0x10U)
#define ECAT_AL_STATUS_PDI_BF4_SHIFT             (4U)
/*! BF4 - Error Ind:
 *  0b0..Device is in State as requested or Flag cleared by command
 *  0b1..Device has not entered requested State or changed State as result of a local action
 */
#define ECAT_AL_STATUS_PDI_BF4(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_PDI_BF4_SHIFT)) & ECAT_AL_STATUS_PDI_BF4_MASK)

#define ECAT_AL_STATUS_PDI_BF5_MASK              (0x20U)
#define ECAT_AL_STATUS_PDI_BF5_SHIFT             (5U)
/*! BF5 - Device Identification:
 *  0b0..Device Identification not valid
 *  0b1..Device Identification loaded
 */
#define ECAT_AL_STATUS_PDI_BF5(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_PDI_BF5_SHIFT)) & ECAT_AL_STATUS_PDI_BF5_MASK)

#define ECAT_AL_STATUS_PDI_BF6_MASK              (0xFFC0U)
#define ECAT_AL_STATUS_PDI_BF6_SHIFT             (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_AL_STATUS_PDI_BF6(x)                (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_PDI_BF6_SHIFT)) & ECAT_AL_STATUS_PDI_BF6_MASK)
/*! @} */

