tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
/*! @name AL_STATUS_CODE - AL Status Code */
/*! @{ */

#define ECAT_AL_STATUS_CODE_BF0_MASK             (0xFFFFU)
#define ECAT_AL_STATUS_CODE_BF0_SHIFT            (0U)
/*! BF0 - AL Status Code */
#define ECAT_AL_STATUS_CODE_BF0(x)               (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_CODE_BF0_SHIFT)) & ECAT_AL_STATUS_CODE_BF0_MASK)
/*! @} */

/*! @name AL_STATUS_CODE_PDI - AL Status Code */
/*! @{ */

#define ECAT_AL_STATUS_CODE_PDI_BF0_MASK         (0xFFFFU)
#define ECAT_AL_STATUS_CODE_PDI_BF0_SHIFT        (0U)
/*! BF0 - AL Status Code */
#define ECAT_AL_STATUS_CODE_PDI_BF0(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_AL_STATUS_CODE_PDI_BF0_SHIFT)) & ECAT_AL_STATUS_CODE_PDI_BF0_MASK)
/*! @} */

/*! @name RUN_LED_OVERRIDE - RUN LED Override */
/*! @{ */

#define ECAT_RUN_LED_OVERRIDE_BF0_MASK           (0xFU)
#define ECAT_RUN_LED_OVERRIDE_BF0_SHIFT          (0U)
/*! BF0 - LED code and AL Status */
#define ECAT_RUN_LED_OVERRIDE_BF0(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_RUN_LED_OVERRIDE_BF0_SHIFT)) & ECAT_RUN_LED_OVERRIDE_BF0_MASK)

#define ECAT_RUN_LED_OVERRIDE_BF4_MASK           (0x10U)
#define ECAT_RUN_LED_OVERRIDE_BF4_SHIFT          (4U)
/*! BF4 - Enable Override:
 *  0b0..Override disabled
 *  0b1..Override enabled
 */
#define ECAT_RUN_LED_OVERRIDE_BF4(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_RUN_LED_OVERRIDE_BF4_SHIFT)) & ECAT_RUN_LED_OVERRIDE_BF4_MASK)

#define ECAT_RUN_LED_OVERRIDE_BF5_MASK           (0xE0U)
#define ECAT_RUN_LED_OVERRIDE_BF5_SHIFT          (5U)
/*! BF5 - Reserved, write 0 */
#define ECAT_RUN_LED_OVERRIDE_BF5(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_RUN_LED_OVERRIDE_BF5_SHIFT)) & ECAT_RUN_LED_OVERRIDE_BF5_MASK)
/*! @} */

/*! @name ERR_LED_OVERRIDE - ERR LED Override */
/*! @{ */

#define ECAT_ERR_LED_OVERRIDE_BF0_MASK           (0xFU)
#define ECAT_ERR_LED_OVERRIDE_BF0_SHIFT          (0U)
/*! BF0 - LED code */
#define ECAT_ERR_LED_OVERRIDE_BF0(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_ERR_LED_OVERRIDE_BF0_SHIFT)) & ECAT_ERR_LED_OVERRIDE_BF0_MASK)

#define ECAT_ERR_LED_OVERRIDE_BF4_MASK           (0x10U)
#define ECAT_ERR_LED_OVERRIDE_BF4_SHIFT          (4U)
/*! BF4 - Enable Override:
 *  0b0..Override disabled
 *  0b1..Override enabled
 */
#define ECAT_ERR_LED_OVERRIDE_BF4(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_ERR_LED_OVERRIDE_BF4_SHIFT)) & ECAT_ERR_LED_OVERRIDE_BF4_MASK)

#define ECAT_ERR_LED_OVERRIDE_BF5_MASK           (0xE0U)
#define ECAT_ERR_LED_OVERRIDE_BF5_SHIFT          (5U)
/*! BF5 - Reserved, write 0 */
#define ECAT_ERR_LED_OVERRIDE_BF5(x)             (((uint8_t)(((uint8_t)(x)) << ECAT_ERR_LED_OVERRIDE_BF5_SHIFT)) & ECAT_ERR_LED_OVERRIDE_BF5_MASK)
/*! @} */

/*! @name PDI_CONTROL - PDI Control */
/*! @{ */

#define ECAT_PDI_CONTROL_BF0_MASK                (0xFFU)
#define ECAT_PDI_CONTROL_BF0_SHIFT               (0U)
/*! BF0 - Process data interface:
 *  0b00000000..Interface deactivated (no PDI)
 *  0b00000001..4 Digital Input
 *  0b00000010..4 Digital Output
 *  0b00000011..2 Digital Input and 2 Digital Output
 *  0b00000100..Digital I/O
 *  0b00000101..SPI Slave
 *  0b00000110..Oversampling I/O
 *  0b00000111..Reserved
 *  0b00001000..16 Bit asynchronous Microcontroller interface
 *  0b00001001..8 Bit asynchronous Microcontroller interface
 *  0b00001010..16 Bit synchronous Microcontroller interface
 *  0b00001011..8 Bit synchronous Microcontroller interface
 *  0b00010000..32 Digital Input and 0 Digital Output
 *  0b00010001..24 Digital Input and 8 Digital Output
 *  0b00010010..16 Digital Input and 16 Digital Output
 *  0b00010011..8 Digital Input and 24 Digital Output
 *  0b00010100..0 Digital Input and 32 Digital Output
 *  0b10000000..On-chip bus.
 */
#define ECAT_PDI_CONTROL_BF0(x)                  (((uint8_t)(((uint8_t)(x)) << ECAT_PDI_CONTROL_BF0_SHIFT)) & ECAT_PDI_CONTROL_BF0_MASK)
/*! @} */

/*! @name ESC_CONFIGURATION - ESC Configuration */
/*! @{ */

#define ECAT_ESC_CONFIGURATION_BF0_MASK          (0x1U)
#define ECAT_ESC_CONFIGURATION_BF0_SHIFT         (0U)
/*! BF0 - Device emulation (control of AL status):
 *  0b0..AL status register has to be set by PDI
 *  0b1..AL status register will be set to value written to AL control register
 */
#define ECAT_ESC_CONFIGURATION_BF0(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF0_SHIFT)) & ECAT_ESC_CONFIGURATION_BF0_MASK)

#define ECAT_ESC_CONFIGURATION_BF1_MASK          (0x2U)
#define ECAT_ESC_CONFIGURATION_BF1_SHIFT         (1U)
/*! BF1 - Enhanced Link detection all ports:
 *  0b0..disabled (if bits [7:4]=0)
 *  0b1..enabled at all ports (overrides bits [7:4])
 */
#define ECAT_ESC_CONFIGURATION_BF1(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF1_SHIFT)) & ECAT_ESC_CONFIGURATION_BF1_MASK)

#define ECAT_ESC_CONFIGURATION_BF2_MASK          (0x4U)
#define ECAT_ESC_CONFIGURATION_BF2_SHIFT         (2U)
/*! BF2 - Distributed Clocks SYNC Out Unit:
 *  0b0..disabled (power saving)
 *  0b1..enabled
 */
#define ECAT_ESC_CONFIGURATION_BF2(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF2_SHIFT)) & ECAT_ESC_CONFIGURATION_BF2_MASK)

#define ECAT_ESC_CONFIGURATION_BF3_MASK          (0x8U)
#define ECAT_ESC_CONFIGURATION_BF3_SHIFT         (3U)
/*! BF3 - Distributed Clocks Latch In Unit:
 *  0b0..disabled (power saving)
 *  0b1..enabled
 */
#define ECAT_ESC_CONFIGURATION_BF3(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF3_SHIFT)) & ECAT_ESC_CONFIGURATION_BF3_MASK)

#define ECAT_ESC_CONFIGURATION_BF4_MASK          (0x10U)
#define ECAT_ESC_CONFIGURATION_BF4_SHIFT         (4U)
/*! BF4 - Enhanced Link port 0:
 *  0b0..disabled (if bit 1=0)
 *  0b1..enabled
 */
#define ECAT_ESC_CONFIGURATION_BF4(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF4_SHIFT)) & ECAT_ESC_CONFIGURATION_BF4_MASK)

#define ECAT_ESC_CONFIGURATION_BF5_MASK          (0x20U)
#define ECAT_ESC_CONFIGURATION_BF5_SHIFT         (5U)
/*! BF5 - Enhanced Link port 1:
 *  0b0..disabled (if bit 1=0)
 *  0b1..enabled
 */
#define ECAT_ESC_CONFIGURATION_BF5(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF5_SHIFT)) & ECAT_ESC_CONFIGURATION_BF5_MASK)

#define ECAT_ESC_CONFIGURATION_BF6_MASK          (0x40U)
#define ECAT_ESC_CONFIGURATION_BF6_SHIFT         (6U)
/*! BF6 - Reserved */
#define ECAT_ESC_CONFIGURATION_BF6(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF6_SHIFT)) & ECAT_ESC_CONFIGURATION_BF6_MASK)

#define ECAT_ESC_CONFIGURATION_BF7_MASK          (0x80U)
#define ECAT_ESC_CONFIGURATION_BF7_SHIFT         (7U)
/*! BF7 - Reserved */
#define ECAT_ESC_CONFIGURATION_BF7(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_ESC_CONFIGURATION_BF7_SHIFT)) & ECAT_ESC_CONFIGURATION_BF7_MASK)
/*! @} */

/*! @name PDI_INFORMATION - PDI Information */
/*! @{ */

#define ECAT_PDI_INFORMATION_BF0_MASK            (0x1U)
#define ECAT_PDI_INFORMATION_BF0_SHIFT           (0U)
/*! BF0 - PDI function
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define ECAT_PDI_INFORMATION_BF0(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_INFORMATION_BF0_SHIFT)) & ECAT_PDI_INFORMATION_BF0_MASK)

