tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF8_MASK (0x700U)
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF8_SHIFT (8U)
/*! BF8 - On-chip bus sub-type for AXI:
 *  0b000..AXI3
 *  0b001..AXI4
 *  0b010..AXI4 LITE
 */
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF8(x) (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF8_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF8_MASK)

#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF11_MASK (0xF800U)
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF11_SHIFT (11U)
/*! BF11 - Reserved */
#define ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF11(x) (((uint16_t)(((uint16_t)(x)) << ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF11_SHIFT)) & ECAT_PDI_ON_CHIP_BUS_EXTENDED_CONFIGURATION_BF11_MASK)
/*! @} */

/*! @name ECAT_EVENT_MASK - ECAT Event Mask */
/*! @{ */

#define ECAT_ECAT_EVENT_MASK_BF0_MASK            (0xFFFFU)
#define ECAT_ECAT_EVENT_MASK_BF0_SHIFT           (0U)
/*! BF0 - ECAT Event masking of the ECAT Event Request Events for mapping into ECAT event field of EtherCAT frames:
 *  0b0000000000000000..Corresponding ECAT Event Request register bit is not mapped
 *  0b0000000000000001..Corresponding ECAT Event Request register bit is mapped
 */
#define ECAT_ECAT_EVENT_MASK_BF0(x)              (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_MASK_BF0_SHIFT)) & ECAT_ECAT_EVENT_MASK_BF0_MASK)
/*! @} */

/*! @name ECAT_EVENT_MASK_PDI - ECAT Event Mask */
/*! @{ */

#define ECAT_ECAT_EVENT_MASK_PDI_BF0_MASK        (0xFFFFU)
#define ECAT_ECAT_EVENT_MASK_PDI_BF0_SHIFT       (0U)
/*! BF0 - ECAT Event masking of the ECAT Event Request Events for mapping into ECAT event field of EtherCAT frames:
 *  0b0000000000000000..Corresponding ECAT Event Request register bit is not mapped
 *  0b0000000000000001..Corresponding ECAT Event Request register bit is mapped
 */
#define ECAT_ECAT_EVENT_MASK_PDI_BF0(x)          (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_MASK_PDI_BF0_SHIFT)) & ECAT_ECAT_EVENT_MASK_PDI_BF0_MASK)
/*! @} */

/*! @name PDI_AL_EVENT_MASK - PDI AL Event Mask */
/*! @{ */

#define ECAT_PDI_AL_EVENT_MASK_BF0_MASK          (0xFFFFFFFFU)
#define ECAT_PDI_AL_EVENT_MASK_BF0_SHIFT         (0U)
/*! BF0 - AL Event masking of the AL Event Request register Events for mapping to PDI IRQ signal:
 *  0b00000000000000000000000000000000..Corresponding AL Event Request register bit is not mapped
 *  0b00000000000000000000000000000001..Corresponding AL Event Request register bit is mapped
 */
#define ECAT_PDI_AL_EVENT_MASK_BF0(x)            (((uint32_t)(((uint32_t)(x)) << ECAT_PDI_AL_EVENT_MASK_BF0_SHIFT)) & ECAT_PDI_AL_EVENT_MASK_BF0_MASK)
/*! @} */

/*! @name PDI_AL_EVENT_MASK_PDI - PDI AL Event Mask */
/*! @{ */

#define ECAT_PDI_AL_EVENT_MASK_PDI_BF0_MASK      (0xFFFFFFFFU)
#define ECAT_PDI_AL_EVENT_MASK_PDI_BF0_SHIFT     (0U)
/*! BF0 - AL Event masking of the AL Event Request register Events for mapping to PDI IRQ signal:
 *  0b00000000000000000000000000000000..Corresponding AL Event Request register bit is not mapped
 *  0b00000000000000000000000000000001..Corresponding AL Event Request register bit is mapped
 */
#define ECAT_PDI_AL_EVENT_MASK_PDI_BF0(x)        (((uint32_t)(((uint32_t)(x)) << ECAT_PDI_AL_EVENT_MASK_PDI_BF0_SHIFT)) & ECAT_PDI_AL_EVENT_MASK_PDI_BF0_MASK)
/*! @} */

/*! @name ECAT_EVENT_REQUEST - ECAT Event Request */
/*! @{ */

#define ECAT_ECAT_EVENT_REQUEST_BF0_MASK         (0x1U)
#define ECAT_ECAT_EVENT_REQUEST_BF0_SHIFT        (0U)
/*! BF0 - DC Latch event:
 *  0b0..No change on DC Latch Inputs
 *  0b1..At least one change on DC Latch Inputs
 */
#define ECAT_ECAT_EVENT_REQUEST_BF0(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF0_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF0_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF1_MASK         (0x2U)
#define ECAT_ECAT_EVENT_REQUEST_BF1_SHIFT        (1U)
/*! BF1 - Reserved */
#define ECAT_ECAT_EVENT_REQUEST_BF1(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF1_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF1_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF2_MASK         (0x4U)
#define ECAT_ECAT_EVENT_REQUEST_BF2_SHIFT        (2U)
/*! BF2 - DL Status event:
 *  0b0..No change in DL Status
 *  0b1..DL Status change
 */
#define ECAT_ECAT_EVENT_REQUEST_BF2(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF2_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF2_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF3_MASK         (0x8U)
#define ECAT_ECAT_EVENT_REQUEST_BF3_SHIFT        (3U)
/*! BF3 - AL Status event:
 *  0b0..No change in AL Status
 *  0b1..AL Status change
 */
#define ECAT_ECAT_EVENT_REQUEST_BF3(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF3_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF3_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF4_MASK         (0x10U)
#define ECAT_ECAT_EVENT_REQUEST_BF4_SHIFT        (4U)
/*! BF4 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 0 event
 *  0b1..Sync Channel 0 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF4(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF4_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF4_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF5_MASK         (0x20U)
#define ECAT_ECAT_EVENT_REQUEST_BF5_SHIFT        (5U)
/*! BF5 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 1 event
 *  0b1..Sync Channel 1 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF5(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF5_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF5_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF6_MASK         (0x40U)
#define ECAT_ECAT_EVENT_REQUEST_BF6_SHIFT        (6U)
/*! BF6 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 2 event
 *  0b1..Sync Channel 2 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF6(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF6_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF6_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF7_MASK         (0x80U)
#define ECAT_ECAT_EVENT_REQUEST_BF7_SHIFT        (7U)
/*! BF7 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 3 event
 *  0b1..Sync Channel 3 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF7(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF7_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF7_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF8_MASK         (0x100U)
#define ECAT_ECAT_EVENT_REQUEST_BF8_SHIFT        (8U)
/*! BF8 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 4 event
 *  0b1..Sync Channel 4 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF8(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF8_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF8_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF9_MASK         (0x200U)
#define ECAT_ECAT_EVENT_REQUEST_BF9_SHIFT        (9U)
/*! BF9 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 5 event
 *  0b1..Sync Channel 5 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF9(x)           (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF9_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF9_MASK)

#define ECAT_ECAT_EVENT_REQUEST_BF10_MASK        (0x400U)
#define ECAT_ECAT_EVENT_REQUEST_BF10_SHIFT       (10U)
/*! BF10 - Mirrors values of each SyncManager Status:
 *  0b0..No Sync Channel 6 event
 *  0b1..Sync Channel 6 event pending
 */
#define ECAT_ECAT_EVENT_REQUEST_BF10(x)          (((uint16_t)(((uint16_t)(x)) << ECAT_ECAT_EVENT_REQUEST_BF10_SHIFT)) & ECAT_ECAT_EVENT_REQUEST_BF10_MASK)

