tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_PDI_ERROR_COUNTER_PDI_BF0_MASK      (0xFFU)
#define ECAT_PDI_ERROR_COUNTER_PDI_BF0_SHIFT     (0U)
/*! BF0 - PDI Error counter (counting is stopped when 0xFF is reached). Counts if a PDI access has an interface error. */
#define ECAT_PDI_ERROR_COUNTER_PDI_BF0(x)        (((uint8_t)(((uint8_t)(x)) << ECAT_PDI_ERROR_COUNTER_PDI_BF0_SHIFT)) & ECAT_PDI_ERROR_COUNTER_PDI_BF0_MASK)
/*! @} */

/*! @name ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER - ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_PDI_ERROR_CODE. */
/*! @{ */

#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF0_MASK (0x1U)
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF0_SHIFT (0U)
/*! BF0 - Busy violation during read access
 *  0b0..no error
 *  0b1..error detected
 */
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF0_SHIFT)) & ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF0_MASK)

#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF1_MASK (0x2U)
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF1_SHIFT (1U)
/*! BF1 - Busy violation during write access
 *  0b0..no error
 *  0b1..error detected
 */
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF1(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF1_SHIFT)) & ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF1_MASK)

#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF2_MASK (0x4U)
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF2_SHIFT (2U)
/*! BF2 - Addressing error for a read access (odd address without BHE)
 *  0b0..no error
 *  0b1..error detected
 */
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF2(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF2_SHIFT)) & ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF2_MASK)

#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF3_MASK (0x8U)
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF3_SHIFT (3U)
/*! BF3 - Addressing error for a write access (odd address without BHE)
 *  0b0..no error
 *  0b1..error detected
 */
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF3(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF3_SHIFT)) & ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF3_MASK)

#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF4_MASK (0xF0U)
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF4_SHIFT (4U)
/*! BF4 - reserved */
#define ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF4(x) (((uint8_t)(((uint8_t)(x)) << ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF4_SHIFT)) & ECAT_ASYNCHRONOUS_SYNCHRONOUS_MICROCONTROLLER_BF4_MASK)
/*! @} */

/*! @name LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT - Lost Link Counter */
/*! @{ */

#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_BF0_MASK (0xFFU)
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_BF0_SHIFT (0U)
/*! BF0 - Lost Link counter of Port y (counting is stopped when 0xff is reached). */
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_BF0_SHIFT)) & ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_BF0_MASK)
/*! @} */

/* The count of ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT */
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_COUNT (2U)

/*! @name LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI - Lost Link Counter */
/*! @{ */

#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_BF0_MASK (0xFFU)
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_BF0_SHIFT (0U)
/*! BF0 - Lost Link counter of Port y (counting is stopped when 0xff is reached). */
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_BF0_SHIFT)) & ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_BF0_MASK)
/*! @} */

/* The count of ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI */
#define ECAT_LOST_LINK_CNTR_LOST_LINK_COUNTER_PORT_PDI_COUNT (2U)

/*! @name WATCHDOG_DIVIDER - Watchdog Divider */
/*! @{ */

#define ECAT_WATCHDOG_DIVIDER_BF0_MASK           (0xFFFFU)
#define ECAT_WATCHDOG_DIVIDER_BF0_SHIFT          (0U)
/*! BF0 - Watchdog divider: Number of 25 MHz tics (minus 2) that represent the basic watchdog
 *    increment. (Default value is 100us = 2498)
 */
#define ECAT_WATCHDOG_DIVIDER_BF0(x)             (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_DIVIDER_BF0_SHIFT)) & ECAT_WATCHDOG_DIVIDER_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_DIVIDER_PDI - Watchdog Divider */
/*! @{ */

#define ECAT_WATCHDOG_DIVIDER_PDI_BF0_MASK       (0xFFFFU)
#define ECAT_WATCHDOG_DIVIDER_PDI_BF0_SHIFT      (0U)
/*! BF0 - Watchdog divider: Number of 25 MHz tics (minus 2) that represent the basic watchdog
 *    increment. (Default value is 100us = 2498)
 */
#define ECAT_WATCHDOG_DIVIDER_PDI_BF0(x)         (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_DIVIDER_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_DIVIDER_PDI_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_TIME_PDI - Register Watchdog Time PDI */
/*! @{ */

#define ECAT_WATCHDOG_TIME_PDI_BF0_MASK          (0xFFFFU)
#define ECAT_WATCHDOG_TIME_PDI_BF0_SHIFT         (0U)
/*! BF0 - Watchdog Time PDI: number or basic watchdog increments (Default value with Watchdog divider 100us means 100ms Watchdog) */
#define ECAT_WATCHDOG_TIME_PDI_BF0(x)            (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_TIME_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_TIME_PDI_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_TIME_PDI_PDI - Register Watchdog Time PDI */
/*! @{ */

#define ECAT_WATCHDOG_TIME_PDI_PDI_BF0_MASK      (0xFFFFU)
#define ECAT_WATCHDOG_TIME_PDI_PDI_BF0_SHIFT     (0U)
/*! BF0 - Watchdog Time PDI: number or basic watchdog increments (Default value with Watchdog divider 100us means 100ms Watchdog) */
#define ECAT_WATCHDOG_TIME_PDI_PDI_BF0(x)        (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_TIME_PDI_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_TIME_PDI_PDI_BF0_MASK)
/*! @} */

