tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
/*! @name WATCHDOG_TIME_PROCESS_DATA - Regsister Watchdog Time Process Data */
/*! @{ */

#define ECAT_WATCHDOG_TIME_PROCESS_DATA_BF0_MASK (0xFFFFU)
#define ECAT_WATCHDOG_TIME_PROCESS_DATA_BF0_SHIFT (0U)
/*! BF0 - Watchdog Time Process Data */
#define ECAT_WATCHDOG_TIME_PROCESS_DATA_BF0(x)   (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_TIME_PROCESS_DATA_BF0_SHIFT)) & ECAT_WATCHDOG_TIME_PROCESS_DATA_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_TIME_PROCESS_DATA_PDI - Regsister Watchdog Time Process Data */
/*! @{ */

#define ECAT_WATCHDOG_TIME_PROCESS_DATA_PDI_BF0_MASK (0xFFFFU)
#define ECAT_WATCHDOG_TIME_PROCESS_DATA_PDI_BF0_SHIFT (0U)
/*! BF0 - Watchdog Time Process Data */
#define ECAT_WATCHDOG_TIME_PROCESS_DATA_PDI_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_TIME_PROCESS_DATA_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_TIME_PROCESS_DATA_PDI_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_STATUS_PROCESS_DATA - Watchdog Status Process Data */
/*! @{ */

#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF0_MASK (0x1U)
#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF0_SHIFT (0U)
/*! BF0 - Watchdog Status of Process Data (triggered by SyncManagers)
 *  0b0..Watchdog Process Data expired
 *  0b1..Watchdog Process Data is active or disabled
 */
#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF0_SHIFT)) & ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF0_MASK)

#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF1_MASK (0xFFFEU)
#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF1_SHIFT (1U)
/*! BF1 - Reserved */
#define ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF1(x) (((uint16_t)(((uint16_t)(x)) << ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF1_SHIFT)) & ECAT_WATCHDOG_STATUS_PROCESS_DATA_BF1_MASK)
/*! @} */

/*! @name WATCHDOG_COUNTER_PROCESS_DATA - Watchdog Counter Process Data */
/*! @{ */

#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_BF0_MASK (0xFFU)
#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_BF0_SHIFT (0U)
/*! BF0 - Watchdog Counter Process Data (counting is stopped when 0xFF is reached). Counts if Process Data Watchdog expires. */
#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_WATCHDOG_COUNTER_PROCESS_DATA_BF0_SHIFT)) & ECAT_WATCHDOG_COUNTER_PROCESS_DATA_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_COUNTER_PROCESS_DATA_PDI - Watchdog Counter Process Data */
/*! @{ */

#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_PDI_BF0_MASK (0xFFU)
#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_PDI_BF0_SHIFT (0U)
/*! BF0 - Watchdog Counter Process Data (counting is stopped when 0xFF is reached). Counts if Process Data Watchdog expires. */
#define ECAT_WATCHDOG_COUNTER_PROCESS_DATA_PDI_BF0(x) (((uint8_t)(((uint8_t)(x)) << ECAT_WATCHDOG_COUNTER_PROCESS_DATA_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_COUNTER_PROCESS_DATA_PDI_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_COUNTER_PDI - Watchdog Counter PDI */
/*! @{ */

#define ECAT_WATCHDOG_COUNTER_PDI_BF0_MASK       (0xFFU)
#define ECAT_WATCHDOG_COUNTER_PDI_BF0_SHIFT      (0U)
/*! BF0 - Watchdog PDI counter (counting is stopped when 0xFF is reached). */
#define ECAT_WATCHDOG_COUNTER_PDI_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_WATCHDOG_COUNTER_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_COUNTER_PDI_BF0_MASK)
/*! @} */

/*! @name WATCHDOG_COUNTER_PDI_PDI - Watchdog Counter PDI */
/*! @{ */

#define ECAT_WATCHDOG_COUNTER_PDI_PDI_BF0_MASK   (0xFFU)
#define ECAT_WATCHDOG_COUNTER_PDI_PDI_BF0_SHIFT  (0U)
/*! BF0 - Watchdog PDI counter (counting is stopped when 0xFF is reached). */
#define ECAT_WATCHDOG_COUNTER_PDI_PDI_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_WATCHDOG_COUNTER_PDI_PDI_BF0_SHIFT)) & ECAT_WATCHDOG_COUNTER_PDI_PDI_BF0_MASK)
/*! @} */

/*! @name EEPROM_CONFIGURATION - EEPROM Configuration */
/*! @{ */

#define ECAT_EEPROM_CONFIGURATION_BF0_MASK       (0x1U)
#define ECAT_EEPROM_CONFIGURATION_BF0_SHIFT      (0U)
/*! BF0 - EEPROM control is offered to PDI
 *  0b0..no
 *  0b1..yes (PDI has EEPROM control)
 */
#define ECAT_EEPROM_CONFIGURATION_BF0(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_BF0_SHIFT)) & ECAT_EEPROM_CONFIGURATION_BF0_MASK)

#define ECAT_EEPROM_CONFIGURATION_BF1_MASK       (0x2U)
#define ECAT_EEPROM_CONFIGURATION_BF1_SHIFT      (1U)
/*! BF1 - Force ECAT access
 *  0b0..Do not change Bit 0x0501[0]
 *  0b1..Reset Bit 0x0501[0] to 0
 */
#define ECAT_EEPROM_CONFIGURATION_BF1(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_BF1_SHIFT)) & ECAT_EEPROM_CONFIGURATION_BF1_MASK)

#define ECAT_EEPROM_CONFIGURATION_BF2_MASK       (0xFCU)
#define ECAT_EEPROM_CONFIGURATION_BF2_SHIFT      (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_EEPROM_CONFIGURATION_BF2(x)         (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_BF2_SHIFT)) & ECAT_EEPROM_CONFIGURATION_BF2_MASK)
/*! @} */

/*! @name EEPROM_CONFIGURATION_PDI - EEPROM Configuration */
/*! @{ */

#define ECAT_EEPROM_CONFIGURATION_PDI_BF0_MASK   (0x1U)
#define ECAT_EEPROM_CONFIGURATION_PDI_BF0_SHIFT  (0U)
/*! BF0 - EEPROM control is offered to PDI
 *  0b0..no
 *  0b1..yes (PDI has EEPROM control)
 */
#define ECAT_EEPROM_CONFIGURATION_PDI_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_PDI_BF0_SHIFT)) & ECAT_EEPROM_CONFIGURATION_PDI_BF0_MASK)

#define ECAT_EEPROM_CONFIGURATION_PDI_BF1_MASK   (0x2U)
#define ECAT_EEPROM_CONFIGURATION_PDI_BF1_SHIFT  (1U)
/*! BF1 - Force ECAT access
 *  0b0..Do not change Bit 0x0501[0]
 *  0b1..Reset Bit 0x0501[0] to 0
 */
#define ECAT_EEPROM_CONFIGURATION_PDI_BF1(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_PDI_BF1_SHIFT)) & ECAT_EEPROM_CONFIGURATION_PDI_BF1_MASK)

#define ECAT_EEPROM_CONFIGURATION_PDI_BF2_MASK   (0xFCU)
#define ECAT_EEPROM_CONFIGURATION_PDI_BF2_SHIFT  (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_EEPROM_CONFIGURATION_PDI_BF2(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_EEPROM_CONFIGURATION_PDI_BF2_SHIFT)) & ECAT_EEPROM_CONFIGURATION_PDI_BF2_MASK)
/*! @} */

