tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF6_MASK    (0xC0U)
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF6_SHIFT   (6U)
/*! BF6 - Reserved, write 0 */
#define ECAT_CYCLIC_UNIT_CONTROL_PDI_BF6(x)      (((uint8_t)(((uint8_t)(x)) << ECAT_CYCLIC_UNIT_CONTROL_PDI_BF6_SHIFT)) & ECAT_CYCLIC_UNIT_CONTROL_PDI_BF6_MASK)
/*! @} */

/*! @name UNIT_ACTIVATION_REGISTER - Register Activation register */
/*! @{ */

#define ECAT_UNIT_ACTIVATION_REGISTER_BF0_MASK   (0x1U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF0_SHIFT  (0U)
/*! BF0 - Sync Out Unit activation:
 *  0b0..Deactivated
 *  0b1..Activated
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF0(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF0_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF0_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF1_MASK   (0x2U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF1_SHIFT  (1U)
/*! BF1 - SYNC0 generation:
 *  0b0..Deactivated
 *  0b1..SYNC0 pulse is generated
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF1(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF1_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF1_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF2_MASK   (0x4U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF2_SHIFT  (2U)
/*! BF2 - SYNC1 generation:
 *  0b0..Deactivated
 *  0b1..SYNC1 pulse is generated
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF2(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF2_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF2_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF3_MASK   (0x8U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF3_SHIFT  (3U)
/*! BF3 - Auto-activation by writing Start Time Cyclic Operation (0x0990:0x0997):
 *  0b0..Disabled
 *  0b1..Auto-activation enabled. 0x0981[0] is set automatically after Start Time is written
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF3(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF3_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF3_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF4_MASK   (0x10U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF4_SHIFT  (4U)
/*! BF4 - Extension of Start Time Cyclic Operation (0x0990:0x0993):
 *  0b0..No extension
 *  0b1..Extend 32 bit written Start Time to 64 bit
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF4(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF4_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF4_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF5_MASK   (0x20U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF5_SHIFT  (5U)
/*! BF5 - Start Time plausibility check:
 *  0b0..Disabled. SyncSignal generation if Start Time is reached.
 *  0b1..Immediate SyncSignal generation if Start Time is outside near future (see 0x0981[6])
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF5(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF5_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF5_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF6_MASK   (0x40U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF6_SHIFT  (6U)
/*! BF6 - Near future configuration (approx.):
 *  0b0..1/2 DC width future (2^31ns or 2^63ns)
 *  0b1..~2.1 sec. future (2^31ns)
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF6(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF6_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF6_MASK)

#define ECAT_UNIT_ACTIVATION_REGISTER_BF7_MASK   (0x80U)
#define ECAT_UNIT_ACTIVATION_REGISTER_BF7_SHIFT  (7U)
/*! BF7 - SyncSignal debug pulse (Vasily bit):
 *  0b0..Deactivated
 *  0b1..Immediately generate one ping only on SYNC0-1 according to 0x0981[2:1] for debugging.
 */
#define ECAT_UNIT_ACTIVATION_REGISTER_BF7(x)     (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_REGISTER_BF7_SHIFT)) & ECAT_UNIT_ACTIVATION_REGISTER_BF7_MASK)
/*! @} */

/*! @name UNI_PULSE_LENGTH_OF_SYNCSIGNALS - Register Pulse Length of SyncSignals */
/*! @{ */

#define ECAT_UNI_PULSE_LENGTH_OF_SYNCSIGNALS_BF0_MASK (0xFFFFU)
#define ECAT_UNI_PULSE_LENGTH_OF_SYNCSIGNALS_BF0_SHIFT (0U)
/*! BF0 - Pulse length of SyncSignals (in Units of 10ns)
 *  0b0000000000000000..Acknowledge mode: SyncSignal will be cleared by reading SYNC[1:0] Status register
 */
#define ECAT_UNI_PULSE_LENGTH_OF_SYNCSIGNALS_BF0(x) (((uint16_t)(((uint16_t)(x)) << ECAT_UNI_PULSE_LENGTH_OF_SYNCSIGNALS_BF0_SHIFT)) & ECAT_UNI_PULSE_LENGTH_OF_SYNCSIGNALS_BF0_MASK)
/*! @} */

/*! @name UNIT_ACTIVATION_STATUS - Register Activation Status */
/*! @{ */

#define ECAT_UNIT_ACTIVATION_STATUS_BF0_MASK     (0x1U)
#define ECAT_UNIT_ACTIVATION_STATUS_BF0_SHIFT    (0U)
/*! BF0 - SYNC0 activation state:
 *  0b0..First SYNC0 pulse is not pending
 *  0b1..First SYNC0 pulse is pending
 */
#define ECAT_UNIT_ACTIVATION_STATUS_BF0(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_STATUS_BF0_SHIFT)) & ECAT_UNIT_ACTIVATION_STATUS_BF0_MASK)

#define ECAT_UNIT_ACTIVATION_STATUS_BF1_MASK     (0x2U)
#define ECAT_UNIT_ACTIVATION_STATUS_BF1_SHIFT    (1U)
/*! BF1 - SYNC1 activation state:
 *  0b0..First SYNC1 pulse is not pending
 *  0b1..First SYNC1 pulse is pending
 */
#define ECAT_UNIT_ACTIVATION_STATUS_BF1(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_STATUS_BF1_SHIFT)) & ECAT_UNIT_ACTIVATION_STATUS_BF1_MASK)

#define ECAT_UNIT_ACTIVATION_STATUS_BF2_MASK     (0x4U)
#define ECAT_UNIT_ACTIVATION_STATUS_BF2_SHIFT    (2U)
/*! BF2 - Start Time Cyclic Operation (0x0990:0x0997) plausibility check result when Sync Out Unit was activated:
 *  0b0..Start Time was within near future
 *  0b1..Start Time was out of near future (0x0981[6])
 */
#define ECAT_UNIT_ACTIVATION_STATUS_BF2(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_STATUS_BF2_SHIFT)) & ECAT_UNIT_ACTIVATION_STATUS_BF2_MASK)

#define ECAT_UNIT_ACTIVATION_STATUS_BF3_MASK     (0xF8U)
#define ECAT_UNIT_ACTIVATION_STATUS_BF3_SHIFT    (3U)
/*! BF3 - Reserved */
#define ECAT_UNIT_ACTIVATION_STATUS_BF3(x)       (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_ACTIVATION_STATUS_BF3_SHIFT)) & ECAT_UNIT_ACTIVATION_STATUS_BF3_MASK)
/*! @} */

