tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
/*! @name UNIT_SYNC0_STATUS - Register SYNC0 Status */
/*! @{ */

#define ECAT_UNIT_SYNC0_STATUS_BF0_MASK          (0x1U)
#define ECAT_UNIT_SYNC0_STATUS_BF0_SHIFT         (0U)
/*! BF0 - SYNC0 state for Acknowledge mode. */
#define ECAT_UNIT_SYNC0_STATUS_BF0(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_SYNC0_STATUS_BF0_SHIFT)) & ECAT_UNIT_SYNC0_STATUS_BF0_MASK)

#define ECAT_UNIT_SYNC0_STATUS_BF1_MASK          (0xFEU)
#define ECAT_UNIT_SYNC0_STATUS_BF1_SHIFT         (1U)
/*! BF1 - Reserved */
#define ECAT_UNIT_SYNC0_STATUS_BF1(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_SYNC0_STATUS_BF1_SHIFT)) & ECAT_UNIT_SYNC0_STATUS_BF1_MASK)
/*! @} */

/*! @name UNIT_SYNC1_STATUS - Register SYNC1 Status */
/*! @{ */

#define ECAT_UNIT_SYNC1_STATUS_BF0_MASK          (0x1U)
#define ECAT_UNIT_SYNC1_STATUS_BF0_SHIFT         (0U)
/*! BF0 - SYNC1 state for Acknowledge mode. */
#define ECAT_UNIT_SYNC1_STATUS_BF0(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_SYNC1_STATUS_BF0_SHIFT)) & ECAT_UNIT_SYNC1_STATUS_BF0_MASK)

#define ECAT_UNIT_SYNC1_STATUS_BF1_MASK          (0xFEU)
#define ECAT_UNIT_SYNC1_STATUS_BF1_SHIFT         (1U)
/*! BF1 - Reserved */
#define ECAT_UNIT_SYNC1_STATUS_BF1(x)            (((uint8_t)(((uint8_t)(x)) << ECAT_UNIT_SYNC1_STATUS_BF1_SHIFT)) & ECAT_UNIT_SYNC1_STATUS_BF1_MASK)
/*! @} */

/*! @name UNIT_START_TIME_CYCLIC_OPERATION - Register Start Time Cyclic Operation */
/*! @{ */

#define ECAT_UNIT_START_TIME_CYCLIC_OPERATION_BF0_MASK (0xFFFFFFFFFFFFFFFFU)
#define ECAT_UNIT_START_TIME_CYCLIC_OPERATION_BF0_SHIFT (0U)
/*! BF0 - Write: Start time (System time) of cyclic operation in ns */
#define ECAT_UNIT_START_TIME_CYCLIC_OPERATION_BF0(x) (((uint64_t)(((uint64_t)(x)) << ECAT_UNIT_START_TIME_CYCLIC_OPERATION_BF0_SHIFT)) & ECAT_UNIT_START_TIME_CYCLIC_OPERATION_BF0_MASK)
/*! @} */

/*! @name UNIT_NEXT_SYNC1_PULSE - Register Next SYNC1 Pulse */
/*! @{ */

#define ECAT_UNIT_NEXT_SYNC1_PULSE_BF0_MASK      (0xFFFFFFFFFFFFFFFFU)
#define ECAT_UNIT_NEXT_SYNC1_PULSE_BF0_SHIFT     (0U)
/*! BF0 - System time of next SYNC1 pulse in ns */
#define ECAT_UNIT_NEXT_SYNC1_PULSE_BF0(x)        (((uint64_t)(((uint64_t)(x)) << ECAT_UNIT_NEXT_SYNC1_PULSE_BF0_SHIFT)) & ECAT_UNIT_NEXT_SYNC1_PULSE_BF0_MASK)
/*! @} */

/*! @name UNIT_SYNC0_CYCLE_TIME - Register SYNC0 Cycle Time */
/*! @{ */

#define ECAT_UNIT_SYNC0_CYCLE_TIME_BF0_MASK      (0xFFFFFFFFU)
#define ECAT_UNIT_SYNC0_CYCLE_TIME_BF0_SHIFT     (0U)
/*! BF0 - Time between two consecutive SYNC0 pulses in ns.
 *  0b00000000000000000000000000000000..Single shot mode, generate only one SYNC0 pulse.
 */
#define ECAT_UNIT_SYNC0_CYCLE_TIME_BF0(x)        (((uint32_t)(((uint32_t)(x)) << ECAT_UNIT_SYNC0_CYCLE_TIME_BF0_SHIFT)) & ECAT_UNIT_SYNC0_CYCLE_TIME_BF0_MASK)
/*! @} */

/*! @name UNIT_SYNC1_CYCLE_TIME - Register SYNC1 Cycle Time */
/*! @{ */

#define ECAT_UNIT_SYNC1_CYCLE_TIME_BF0_MASK      (0xFFFFFFFFU)
#define ECAT_UNIT_SYNC1_CYCLE_TIME_BF0_SHIFT     (0U)
/*! BF0 - Time between SYNC0 pulse and SYNC1 pulse in ns */
#define ECAT_UNIT_SYNC1_CYCLE_TIME_BF0(x)        (((uint32_t)(((uint32_t)(x)) << ECAT_UNIT_SYNC1_CYCLE_TIME_BF0_SHIFT)) & ECAT_UNIT_SYNC1_CYCLE_TIME_BF0_MASK)
/*! @} */

/*! @name LATCH0_CONTROL - Register Latch0 Control */
/*! @{ */

#define ECAT_LATCH0_CONTROL_BF0_MASK             (0x1U)
#define ECAT_LATCH0_CONTROL_BF0_SHIFT            (0U)
/*! BF0 - Latch0 positive edge:
 *  0b0..Continuous Latch active
 *  0b1..Single event (only first event active)
 */
#define ECAT_LATCH0_CONTROL_BF0(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_CONTROL_BF0_SHIFT)) & ECAT_LATCH0_CONTROL_BF0_MASK)

#define ECAT_LATCH0_CONTROL_BF1_MASK             (0x2U)
#define ECAT_LATCH0_CONTROL_BF1_SHIFT            (1U)
/*! BF1 - Latch0 negative edge:
 *  0b0..Continuous Latch active
 *  0b1..Single event (only first event active)
 */
#define ECAT_LATCH0_CONTROL_BF1(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_CONTROL_BF1_SHIFT)) & ECAT_LATCH0_CONTROL_BF1_MASK)

#define ECAT_LATCH0_CONTROL_BF2_MASK             (0xFCU)
#define ECAT_LATCH0_CONTROL_BF2_SHIFT            (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_LATCH0_CONTROL_BF2(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_CONTROL_BF2_SHIFT)) & ECAT_LATCH0_CONTROL_BF2_MASK)
/*! @} */

/*! @name LATCH1_CONTROL - Register Latch1 Control */
/*! @{ */

#define ECAT_LATCH1_CONTROL_BF0_MASK             (0x1U)
#define ECAT_LATCH1_CONTROL_BF0_SHIFT            (0U)
/*! BF0 - Latch1 positive edge:
 *  0b0..Continuous Latch active
 *  0b1..Single event (only first event active)
 */
#define ECAT_LATCH1_CONTROL_BF0(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_CONTROL_BF0_SHIFT)) & ECAT_LATCH1_CONTROL_BF0_MASK)

#define ECAT_LATCH1_CONTROL_BF1_MASK             (0x2U)
#define ECAT_LATCH1_CONTROL_BF1_SHIFT            (1U)
/*! BF1 - Latch1 negative edge:
 *  0b0..Continuous Latch active
 *  0b1..Single event (only first event active)
 */
#define ECAT_LATCH1_CONTROL_BF1(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_CONTROL_BF1_SHIFT)) & ECAT_LATCH1_CONTROL_BF1_MASK)

#define ECAT_LATCH1_CONTROL_BF2_MASK             (0xFCU)
#define ECAT_LATCH1_CONTROL_BF2_SHIFT            (2U)
/*! BF2 - Reserved, write 0 */
#define ECAT_LATCH1_CONTROL_BF2(x)               (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_CONTROL_BF2_SHIFT)) & ECAT_LATCH1_CONTROL_BF2_MASK)
/*! @} */

/*! @name LATCH0_STATUS - Register Latch0 Status */
/*! @{ */

#define ECAT_LATCH0_STATUS_BF0_MASK              (0x1U)
#define ECAT_LATCH0_STATUS_BF0_SHIFT             (0U)
/*! BF0 - Event Latch0 positive edge.
 *  0b0..Positive edge not detected or continuous mode
 *  0b1..Positive edge detected in single event mode only.
 */
#define ECAT_LATCH0_STATUS_BF0(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_STATUS_BF0_SHIFT)) & ECAT_LATCH0_STATUS_BF0_MASK)

#define ECAT_LATCH0_STATUS_BF1_MASK              (0x2U)
#define ECAT_LATCH0_STATUS_BF1_SHIFT             (1U)
/*! BF1 - Event Latch0 negative edge.
 *  0b0..Negative edge not detected or continuous mode
 *  0b1..Negative edge detected in single event mode only
 */
#define ECAT_LATCH0_STATUS_BF1(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_STATUS_BF1_SHIFT)) & ECAT_LATCH0_STATUS_BF1_MASK)

