tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ECAT.h
#define ECAT_LATCH0_STATUS_BF2_MASK              (0x4U)
#define ECAT_LATCH0_STATUS_BF2_SHIFT             (2U)
/*! BF2 - Latch0 pin state */
#define ECAT_LATCH0_STATUS_BF2(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_STATUS_BF2_SHIFT)) & ECAT_LATCH0_STATUS_BF2_MASK)

#define ECAT_LATCH0_STATUS_BF3_MASK              (0xF8U)
#define ECAT_LATCH0_STATUS_BF3_SHIFT             (3U)
/*! BF3 - Reserved */
#define ECAT_LATCH0_STATUS_BF3(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH0_STATUS_BF3_SHIFT)) & ECAT_LATCH0_STATUS_BF3_MASK)
/*! @} */

/*! @name LATCH1_STATUS - Register Latch1 Status */
/*! @{ */

#define ECAT_LATCH1_STATUS_BF0_MASK              (0x1U)
#define ECAT_LATCH1_STATUS_BF0_SHIFT             (0U)
/*! BF0 - Event Latch1 positive edge.
 *  0b0..Positive edge not detected or continuous mode
 *  0b1..Positive edge detected in single event mode only.
 */
#define ECAT_LATCH1_STATUS_BF0(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_STATUS_BF0_SHIFT)) & ECAT_LATCH1_STATUS_BF0_MASK)

#define ECAT_LATCH1_STATUS_BF1_MASK              (0x2U)
#define ECAT_LATCH1_STATUS_BF1_SHIFT             (1U)
/*! BF1 - Event Latch1 negative edge.
 *  0b0..Negative edge not detected or continuous mode
 *  0b1..Negative edge detected in single event mode only.
 */
#define ECAT_LATCH1_STATUS_BF1(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_STATUS_BF1_SHIFT)) & ECAT_LATCH1_STATUS_BF1_MASK)

#define ECAT_LATCH1_STATUS_BF2_MASK              (0x4U)
#define ECAT_LATCH1_STATUS_BF2_SHIFT             (2U)
/*! BF2 - Latch1 pin state */
#define ECAT_LATCH1_STATUS_BF2(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_STATUS_BF2_SHIFT)) & ECAT_LATCH1_STATUS_BF2_MASK)

#define ECAT_LATCH1_STATUS_BF3_MASK              (0xF8U)
#define ECAT_LATCH1_STATUS_BF3_SHIFT             (3U)
/*! BF3 - Reserved */
#define ECAT_LATCH1_STATUS_BF3(x)                (((uint8_t)(((uint8_t)(x)) << ECAT_LATCH1_STATUS_BF3_SHIFT)) & ECAT_LATCH1_STATUS_BF3_MASK)
/*! @} */

/*! @name LATCH0_TIME_POSITIVE_EDGE - Register Latch0 Time Positive Edge */
/*! @{ */

#define ECAT_LATCH0_TIME_POSITIVE_EDGE_BF0_MASK  (0xFFFFFFFFFFFFFFFFU)
#define ECAT_LATCH0_TIME_POSITIVE_EDGE_BF0_SHIFT (0U)
/*! BF0 - System time at the positive edge of the Latch0 signal. */
#define ECAT_LATCH0_TIME_POSITIVE_EDGE_BF0(x)    (((uint64_t)(((uint64_t)(x)) << ECAT_LATCH0_TIME_POSITIVE_EDGE_BF0_SHIFT)) & ECAT_LATCH0_TIME_POSITIVE_EDGE_BF0_MASK)
/*! @} */

/*! @name LATCH0_TIME_NEGATIVE_EDGE - Register Latch0 Time Negative Edge */
/*! @{ */

#define ECAT_LATCH0_TIME_NEGATIVE_EDGE_BF0_MASK  (0xFFFFFFFFFFFFFFFFU)
#define ECAT_LATCH0_TIME_NEGATIVE_EDGE_BF0_SHIFT (0U)
/*! BF0 - System time at the negative edge of the Latch0 signal. */
#define ECAT_LATCH0_TIME_NEGATIVE_EDGE_BF0(x)    (((uint64_t)(((uint64_t)(x)) << ECAT_LATCH0_TIME_NEGATIVE_EDGE_BF0_SHIFT)) & ECAT_LATCH0_TIME_NEGATIVE_EDGE_BF0_MASK)
/*! @} */

/*! @name LATCH1_TIME_POSITIVE_EDGE - Register Latch1 Time Positive Edge */
/*! @{ */

#define ECAT_LATCH1_TIME_POSITIVE_EDGE_BF0_MASK  (0xFFFFFFFFFFFFFFFFU)
#define ECAT_LATCH1_TIME_POSITIVE_EDGE_BF0_SHIFT (0U)
/*! BF0 - System time at the positive edge of the Latch1 signal. */
#define ECAT_LATCH1_TIME_POSITIVE_EDGE_BF0(x)    (((uint64_t)(((uint64_t)(x)) << ECAT_LATCH1_TIME_POSITIVE_EDGE_BF0_SHIFT)) & ECAT_LATCH1_TIME_POSITIVE_EDGE_BF0_MASK)
/*! @} */

/*! @name LATCH1_TIME_NEGATIVE_EDGE - Register Latch1 Time Negative Edge */
/*! @{ */

#define ECAT_LATCH1_TIME_NEGATIVE_EDGE_BF0_MASK  (0xFFFFFFFFFFFFFFFFU)
#define ECAT_LATCH1_TIME_NEGATIVE_EDGE_BF0_SHIFT (0U)
/*! BF0 - System time at the negative edge of the Latch1 signal. */
#define ECAT_LATCH1_TIME_NEGATIVE_EDGE_BF0(x)    (((uint64_t)(((uint64_t)(x)) << ECAT_LATCH1_TIME_NEGATIVE_EDGE_BF0_SHIFT)) & ECAT_LATCH1_TIME_NEGATIVE_EDGE_BF0_MASK)
/*! @} */

/*! @name ETHERCAT_BUFFER_CHANGE_EVENT_TIME - Register EtherCAT Buffer Change Event Time */
/*! @{ */

#define ECAT_ETHERCAT_BUFFER_CHANGE_EVENT_TIME_BF0_MASK (0xFFFFFFFFU)
#define ECAT_ETHERCAT_BUFFER_CHANGE_EVENT_TIME_BF0_SHIFT (0U)
/*! BF0 - Local time at the beginning of the frame which causes at least one SyncManager to assert an ECAT event */
#define ECAT_ETHERCAT_BUFFER_CHANGE_EVENT_TIME_BF0(x) (((uint32_t)(((uint32_t)(x)) << ECAT_ETHERCAT_BUFFER_CHANGE_EVENT_TIME_BF0_SHIFT)) & ECAT_ETHERCAT_BUFFER_CHANGE_EVENT_TIME_BF0_MASK)
/*! @} */

/*! @name PDI_BUFFER_START_EVENT_TIME - Register PDI Buffer Start Event Time */
/*! @{ */

#define ECAT_PDI_BUFFER_START_EVENT_TIME_BF0_MASK (0xFFFFFFFFU)
#define ECAT_PDI_BUFFER_START_EVENT_TIME_BF0_SHIFT (0U)
/*! BF0 - Local time when at least one SyncManager asserts a PDI buffer start event */
#define ECAT_PDI_BUFFER_START_EVENT_TIME_BF0(x)  (((uint32_t)(((uint32_t)(x)) << ECAT_PDI_BUFFER_START_EVENT_TIME_BF0_SHIFT)) & ECAT_PDI_BUFFER_START_EVENT_TIME_BF0_MASK)
/*! @} */

/*! @name PDI_BUFFER_CHANGE_EVENT_TIME - Register PDI Buffer Change Event Time */
/*! @{ */

#define ECAT_PDI_BUFFER_CHANGE_EVENT_TIME_BF0_MASK (0xFFFFFFFFU)
#define ECAT_PDI_BUFFER_CHANGE_EVENT_TIME_BF0_SHIFT (0U)
/*! BF0 - Local time when at least one SyncManager asserts a PDI buffer change event */
#define ECAT_PDI_BUFFER_CHANGE_EVENT_TIME_BF0(x) (((uint32_t)(((uint32_t)(x)) << ECAT_PDI_BUFFER_CHANGE_EVENT_TIME_BF0_SHIFT)) & ECAT_PDI_BUFFER_CHANGE_EVENT_TIME_BF0_MASK)
/*! @} */

/*! @name PRODUCT_ID_IP_CORE - Register Product ID IP Core */
/*! @{ */

#define ECAT_PRODUCT_ID_IP_CORE_BF0_MASK         (0xFFFFFFFFFFFFFFFFU)
#define ECAT_PRODUCT_ID_IP_CORE_BF0_SHIFT        (0U)
/*! BF0 - Product ID */
#define ECAT_PRODUCT_ID_IP_CORE_BF0(x)           (((uint64_t)(((uint64_t)(x)) << ECAT_PRODUCT_ID_IP_CORE_BF0_SHIFT)) & ECAT_PRODUCT_ID_IP_CORE_BF0_MASK)
/*! @} */

/*! @name VENDOR_ID_IP_CORE - Register Vendor ID IP Core */
/*! @{ */

#define ECAT_VENDOR_ID_IP_CORE_BF0_MASK          (0xFFFFFFFFU)
#define ECAT_VENDOR_ID_IP_CORE_BF0_SHIFT         (0U)
/*! BF0 - Vendor ID */
#define ECAT_VENDOR_ID_IP_CORE_BF0(x)            (((uint64_t)(((uint64_t)(x)) << ECAT_VENDOR_ID_IP_CORE_BF0_SHIFT)) & ECAT_VENDOR_ID_IP_CORE_BF0_MASK)

#define ECAT_VENDOR_ID_IP_CORE_BF32_MASK         (0xFFFFFFFF00000000U)
#define ECAT_VENDOR_ID_IP_CORE_BF32_SHIFT        (32U)
/*! BF32 - Reserved */
#define ECAT_VENDOR_ID_IP_CORE_BF32(x)           (((uint64_t)(((uint64_t)(x)) << ECAT_VENDOR_ID_IP_CORE_BF32_SHIFT)) & ECAT_VENDOR_ID_IP_CORE_BF32_MASK)
/*! @} */

/*! @name GENERAL_PURPOSE_OUTPUTS - Register General Purpose Outputs */
/*! @{ */

#define ECAT_GENERAL_PURPOSE_OUTPUTS_BF0_MASK    (0xFFFFU)
#define ECAT_GENERAL_PURPOSE_OUTPUTS_BF0_SHIFT   (0U)
/*! BF0 - General Purpose Output Data */
#define ECAT_GENERAL_PURPOSE_OUTPUTS_BF0(x)      (((uint16_t)(((uint16_t)(x)) << ECAT_GENERAL_PURPOSE_OUTPUTS_BF0_SHIFT)) & ECAT_GENERAL_PURPOSE_OUTPUTS_BF0_MASK)
/*! @} */

/*! @name GENERAL_PURPOSE_INPUTS - Register General Purpose Inputs */
/*! @{ */

#define ECAT_GENERAL_PURPOSE_INPUTS_BF0_MASK     (0xFFFFU)
#define ECAT_GENERAL_PURPOSE_INPUTS_BF0_SHIFT    (0U)
/*! BF0 - General Purpose Input Data */
#define ECAT_GENERAL_PURPOSE_INPUTS_BF0(x)       (((uint16_t)(((uint16_t)(x)) << ECAT_GENERAL_PURPOSE_INPUTS_BF0_SHIFT)) & ECAT_GENERAL_PURPOSE_INPUTS_BF0_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ECAT_Register_Masks */


/*!
 * @}
 */ /* end of group ECAT_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ECAT_H_ */

